{
    "pdf_content": {
        "page_1": "Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 1 Disclosure Guide",
        "page_2": "2 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Disclosure Guide TABLE OF CONTENTS INTRODUCTION 3 TIMING AND FREQUENCY OF DATA 6 LOAN LEVEL FILE 9 SECURITY LEVEL FILE 31 SECURITY SUPPLEMENTAL FILE 45 EXCHANGE FILES 95 MULTICLASS SINGLE CLASS TAX DISCLOSURE FILES 100 APPENDIX TRANSLATED ENUMERATIONS 103",
        "page_3": "3 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Introduction INTRODUCTION",
        "page_4": "4 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Introduction INTRODUCTION This guide is designed to serve as reference tool for investors in Freddie Mac mortgage securities and vendors of Freddie Mac mortgage-related securities information. It provides timing and frequency of disclosure data transmitted directly from Freddie Mac or through independent information vendors, and file formats of the transmissions currently produced and distributed by Freddie Mac. This guide also provides technical specifications that include definitions, enumerations, datatypes, formats and maximum attribute lengths for all disclosure files. The file layouts are the same for daily issuance and monthly files, with Loan level and Security level data in separate files. This guide is divided into five distinct disclosure related sections Loan Level Security Level Security Supplemental Level Exchange related files Tax Disclosure files are created in text txt format with pipe delimiter separated values except Tax related files . The text files will be compressed in zipped zip format. Freddie Mac Offering Circulars and their related supplements provide more detailed information on Freddie Mac mortgage securities. For copy of an Offering Circular, including the Offering Circular Supplement OCS , please visit our website at www.freddiemac.com mbs. Investor Inquiry is available to answer any questions related to Freddie Mac mortgage securities. To contact Investor Inquiry call 800 336-3672 or send e-mail to Investor Inquiry freddiemac.com. Freddie Mac Mortgage Securities website www.freddiemac.com mbs contains current and historical disclosure data for MBS, PCs, REMICs and other securities. Freddie Mac provides mortgage-backed securities disclosure information through several disclosure vendors. For listing of Freddie Mac disclosure vendors, please contact Investor Inquiry. This guide will be updated as changes occur and posted to the Freddie Mac mortgage securities website. Changes from the previous guide are highlighted in yellow. This document is neither an offer to sell nor solicitation of an offer to buy any of the securities described herein, which are offered only by the applicable offering circulars and related supplements, which incorporate Freddie Mac Annual Report or Form 10-K and certain other reports filed with the Securities and Exchange Commission. For the complete description and for important information, please see Loan-Level Disclosure Variable Names and Descriptions on the Freddie Mac website http www.freddiemac.com mbs docs fs lld.pdf",
        "page_5": "5 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Introduction The chart below classifies the prefixes found on each file. File 1 File 2 Pseudopool File Prefix A0, A1, A2, A3, A4, A5, A6, A7, A8, A9, B0, B1, B2, B3, B4, B5, B6, B7, B8, B9, C0, C1, C2, C3, C4, C5, C6, C7, C8, C9, D0, D1, D2, D3, D4, D5, D6, D7, D8, D9, E0, E1, E2, E3, E4, E5, E6, E7, E8, E9, F5, F6, F7, F9, G0, G1, G2, G3, G6, G7, H0, H1, H2, H8, J0, J1, J2, J3, J4, J5, J6, J7, J8, J9, K0, K3, K9, L0, L1, M2, M3, M4, M5, M6, M7, N2, N3, N4, N5, N6, N7, NA, NB, O2, O3, O5, O6, P0, P1, P2, P3, P4, P5, P6, P9, Q0, Q1, Q2, Q3, Q4, Q5, Q6, Q7, Q8, Q9, S0, S1, S2, S3, S4, S5, S6, S7, S8, S9, T3, T4, T5, T6, U1, U2, U3, U4, U5, U6, U7, U8, U9, V6, V7, V8, Z4, Z5, Z6, 3A, 3B, 3C, 3D, 3E, 3F, 3G, 3H, 3I, 3J, 3K, 3L, 3M, 3N, 3O, 3P, 3Q, 3R, 3S, 3T, 3U, 3V, 3W, 3X, 3Y, 3Z, 4L, 4M, 4N, 4O, 4P, 4Q, 4R, 4S, 4T, 4U, 4V, 5B, 5C, 5D, 5E, 5F, 5G, 5H, 5I, 5J, 5K, 5L, 5M, 5N, 5O, 5P, 5Q, 5R, 5S, 5T, 5U, 5V, 5W, 5X, 5Y, 5Z, 6A, 6B, 6C, 6D, 6E, 6F, 6G, 6H, 6I, 6M, 6N, 6O, 6P, 6Q, 6R, 6S 6T, 6U, 6V, 7D, 7E,7F, 7G, 7H, 7I, 7J, 7K, 7M, 7N, 7O, 7P, 7Q, 7R, 7S, CI, CL, CN, CT, ZI, ZL, ZN, ZT 17, 35, 36, 39, 40, 41, 42, 43, 60, 61, 63, 64, 68, 71, 74, 75, 76, 77, 78, 84, 86, 87, 94, 96, 1A, 1B, 1C, 1E, 1F, 1G, 1H, 1J, 1K, 1L, 1M, 1N, 1Q, 1R, 2B, 53, 54, 55, 5A, 88, 97, HA, HB, MA, MB, R0, 4A, 4B, 4C, 4D, 4E, 4F, 4G, 4H, 4I, 4J, 4K, 8A, 8B, 8C, 8D X0 For more information regarding PC Prefixes, please refer to our PC Prefix Library http www.freddiemac.com mbs docs prefixlibrary.xls",
        "page_6": "Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 6 Introduction TIMING AND FREQUENCY OF DATA",
        "page_7": "7 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File TIMING AND FREQUENCY OF DISCLOSURE Transmission Name Description Filename Format Text files will be compressed in zipped format Day of the Month Publicly Available Daily Files Loan, Security and Supplemental Level Daily Issuance Loan Level File 1 Initial loan-level information on newly issued pools flYYMMDD.txt 6 30 A.M. Daily Issuance Loan Level File 1 Intraday 2 Initial loan-level information on newly issued pools flYYMMDD 2.txt 11 30 AM Daily Issuance Loan Level File 1 Intraday 3 Initial loan-level information on newly issued pools flYYMMDD 3.txt 3 30 PM Daily Issuance Security File 1 Information on newly issued pools dnYYMMDD.txt 6 30 A.M. Daily Issuance Security File 1 Intraday 2 Information on newly issued pools dnYYMMDD 2.txt 11 30 AM Daily Issuance Security File 1 Intraday 3 Information on newly issued pools dnYYMMDD 3.txt 3 30 PM Daily Issuance Security Supplemental File 1 Information on newly issued pools wfYYMMDD.txt 6 30 A.M. Daily Issuance Security Supplemental File 1 Intraday 2 Information on newly issued pools wfYYMMDD 2.txt 11 30 AM Daily Issuance Security Supplemental File 1 Intraday 3 Information on newly issued pools wfYYMMDD 3.txt 3 30 PM Daily Issuance Security Supplemental File 2 Information on newly issued pools wgYYMMDD.txt 6 30 A.M. Daily Issuance Loan Level File 2 Initial loan-level information on newly issued pools alYYMMDD.txt 6 30 A.M. Daily Issuance Security File 2 Information on newly issued pools dbYYMMDD.txt 6 30 A.M. Pseudopool Issuance Security Core Factors for Pseudopools xaYYMMDD.txt 6 30 A.M. Pseudopool Issuance Security Supplemental Quartiles for Pseudopools and Assorted Data xoYYMMDD.txt 6 30 A.M. Pseudopool Daily New Issuance Report Information on newly issued Pseudopools xrYYMMDD.txt 6 30 A.M. Monthly Files Loan, Security and Supplemental Level Monthly Loan Level File 1 Updated monthly loan-level information fuYYMMDD.txt 4th Business Day 4 30 P.M. Monthly Loan Level File 2 Updated monthly loan-level information auYYMMDD.txt Monthly Security Core File 1 Factors for pools fdYYMMDD.txt Monthly Security Core File 2 Factors for pools arYYMMDD.txt Monthly Security Supplemental File 1 Quartiles for pools Assorted Data fqYYMMDD.txt Monthly Security Supplemental File 2 Quartiles for pools Assorted Data geYYMMDD.txt Pseudopool Monthly Security Core File Factors for Pseudopools xfYYMMDD.txt Pseudopool Monthly Security Supplemental File Quartiles for Pseudopools and Assorted Data xsYYMMDD.txt Exchange files Daily 45-Day to 55-Day Exchange Activity Daily 45-Day to 55-Day Exchange Activity edYYMMDD.txt 6 30 A.M. Cumulative 45-Day to 55-Day Exchange Activity Cumulative 45-Day to 55-Day Exchange Activity ecYYMMDD.txt Aggregate Level 1 Collateral Exchange Activity Aggregate Level 1 Collateral Exchange Activity eaYYMMDD.txt Tax Files Multiclass Tax Type File 1 FRE MCTAX YY YY.typ Quarterly Multiclass Tax Factor File 1 FRE MCTAX YY YY.fac Quarterly",
        "page_8": "8 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File Single Class Tax Type File 1 FRE SCTAX YY YY.typ Quarterly Single Class Tax Factor File 1 FRE SCTAX YY YY.fac Quarterly Multiclass Tax Type File 2 FRE2 MCTAX Y YYY.typ Quarterly Multiclass Tax Factor File 2 FRE2 MCTAX Y YYY.fac Quarterly Single Class Tax Type File 2 FRE2 SCTAX Y YYY.typ Annual Single Class Tax Factor File 2 FRE2 SCTAX Y YYY.fac Annual Note Freddie Mac mortgage security data files will not be disseminated on the holidays observed by the Federal Reserve System. Mortgage security data files will be disseminated on the next business day. The Disclosure Holiday Schedule is disclosed in the quick links section of the mortgage securities page http www.freddiemac.com mbs docs holiday schedule.pdf . Files specific to ARMS, Reinstated, Modified, and 75 Day Fixed rate mortgages. Effective with Single Security June 3, 2019 . These files will be made available 3 times day, even if the file contains zero records. Intraday file 1 will contain all issuance activity for the prior day. Intraday file 2 and 3 are intended for the preliminary disclosure of FRE Supers and will not be cumulative.",
        "page_9": "9 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File LOAN LEVEL FILE",
        "page_10": "10 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File The daily loan level issuance file and the monthly loan level file contain the aligned loan level data attributes for Freddie Mac mortgage-backed securities. The layout of the files is identical. Original information is calculated based on information available when the security was issued and updated information in the monthly file is calculated based on the mortgage information reported to Freddie Mac by servicers. This data should be considered in conjunction with the information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The loan level data file includes the attribute names, definitions, enumerations, data types, formats, max lengths and implementation notes. Freddie Mac will publish two daily loan level files each business day in the morning and two monthly loan level files. Most of Freddie Mac securities will be in one file, but we will publish second loan level file with the data for the following securities Adjustable-Rate Mortgages ARM , Modified, Reinstated 75-Day payment delay Fixed-Rate PC securities. To find prefixes included in each file, please refer to the Introduction section. ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-001 Loan Identifier The unique designation assigned to the loan by the issuer. String 12 Daily Loan Level File 1 For pools issued after 10 1 2018, the Loan Identifier is 10-character string. Monthly Loan Level File 1 For pools issued after 10 1 2018, the Loan Identifier is 10- character string. For pools issued prior to that date, the identifier will be 12- character string. Daily Monthly Loan Level Files 2 The Loan Identifier is 12- character string. The first 6 characters will match the pool number, second 6 characters is sequential loan count. L-002 Loan Correction Indicator The indicator denoting whether any attributes for the loan have changed from previous disclosures. Yes No Added Deleted String 1 L-003 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 L-004 Security Identifier The unique designation assigned to the security by the issuer. String 6 L-005 CUSIP The unique designation assigned to the security by the Committee on Uniform String 9",
        "page_11": "11 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes Securities Identification Procedures CUSIP . L-006 Mortgage Loan Amount The dollar amount of the loan as stated on the note at the time the loan was originated or modified. For reperforming, modified fixed-rate and modified step- rate loans, this value represents both the interest bearing and non-interest- bearing amount. Numeric 9.2 12 Privacy Masking rounded to nearest thousand, if 500 L-007 Issuance Investor Loan UPB The unpaid principal balance of the loan as it contributes to the balance of the security at the time the security was issued. Numeric 9.2 12 Privacy Masking If loan age 6 months, round to nearest thousand if 500 L-008 Current Investor Loan UPB The unpaid principal balance of the loan as it contributes to the current balance of the security. Numeric 9.2 12 Privacy Masking If loan age 6 months, round to nearest thousand if 500 L-009 Amortization Type The classification of the loan as having either fixed- or an adjustable-interest rate. FRM Fixed-Rate ARM Adjustable- Rate String 3 L-010 Original Interest Rate The interest rate of the loan as stated on the note at the time the loan was originated or modified. 99.999 Not Available Numeric 2.3 6 If value 0 or 25, then the rate is considered not available securities issued on or after 9 1 2017 L-011 Issuance Interest Rate The interest rate of the loan in effect at the time the security was issued. 99.999 Not Available Numeric 2.3 6 If value 0 or 25, then the rate is considered not available applicable to securities issued on or after 9 1 2017 L-012 Current Interest Rate The interest rate of the loan in effect during the current reporting period. 99.999 Not Available Numeric 2.3 6 If value 0 or 25, then the rate is considered not available securities issued on or after 9 1 2017 Not Available for Freddie Mac ARMs L-013 Issuance Net Interest Rate The interest rate of the loan at the time the security was issued less servicing fees and guarantor fees. 99.999 Not Available Numeric 2.3 6 If value 0 or 25, then the rate is considered not available securities issued on or after 9 1 2017 ",
        "page_12": "12 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-014 Current Net Interest Rate The interest rate of the loan in effect during the current reporting period less servicing fees and guarantor fees. 99.999 Not Available Numeric 2.3 6 If value 0 or 25, then the rate is considered not available securities issued on or after 9 1 2017 L-015 First Payment Date The month and year that the first scheduled payment on the loan is due. Date MMCC YY 6 L-016 Maturity Date The month and year that the final scheduled payment on the loan is due. Date MMCC YY 6 L-017 Loan Term The number of months in which regularly scheduled borrower payments are due. Numeric 3 L-018 Remaining Months to Maturity The number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 Value can be Negative L-019 Loan Age The number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 Value can be Negative L-020 Loan-To-Value LTV The ratio, expressed as percentage, obtained by dividing the amount of the loan at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step- rate loans, this value will be blank. 999 Not Available Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 L-021 Combined Loan-To-Value CLTV The ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. 999 Not Available Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 ",
        "page_13": "13 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes For reperforming, modified fixed-rate and modified step- rate loans, this value will be blank. L-022 Debt-To-Income DTI The ratio obtained by dividing the total monthly debt expense by the total monthly income of the borrower at the time the loan was originated or modified. 999 Not Available Numeric 3 If value 1 or 65, then the ratio is considered not available L-023 Borrower Credit Score The standardized credit score used to evaluate the borrower during the loan origination process. For reperforming, modified fixed-rate and modified step- rate loans, this value will be blank. 9999 Not Available Numeric 4 If value 300 or 850, then the score is considered not available L-024 FILLER L-025 FILLER L-026 FILLER L-027 Number of Borrowers The number of borrowers who, at the time the loan was originated, are obligated to repay the loan. 1 1 2 2 3 3 4 4 5 5 6 6 7 7 8 8 9 9 10 10 99 Not Available Numeric 2 If value 1 or 10, then the count is considered not available securities issued on or after 9 1 2017 . Any data corrections made to securities issued prior to that date will align to the new disclosure and may reflect greater number of borrowers than was initially disclosed. L-028 First Time Home Buyer Indicator The indicator denoting whether borrower on the loan qualifies as first-time homebuyer. Yes No 9 Not Available String 1",
        "page_14": "14 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-029 Loan Purpose The classification describing the purpose of the loan. Refinance - Cash Out Refinance - No Cash Out Refinance - Not Specified Purchase Modified - Loss Mitigation 9 Not Available String 1 L-030 Occupancy Status The classification describing the property occupancy status at the time the loan was originated. For reperforming, modified fixed-rate and modified step- rate loans, this value will be blank. Primary Residence Second Home Investment Property 9 Not Available String 1 L-031 Number of Units The number of dwelling units in the mortgaged property at the time the loan was originated. 1 1 2 2 3 3 4 4 99 Not Available Numeric 2 If value 1 or 4, then the count is considered not available L-032 Property Type The classification describing the type of property that secures the loan. CP Cooperative CO Condominium PU Planned Unit Development SF Single-Family MH Manufactured Housing 99 Not Available String 2 For securities issued prior to 8 28 2017, Property Types Leasehold and 1-4 Fee Simple are mapped to Single Family L-033 Channel The origination channel used by the party that delivered the loan to the issuer. For reperforming, modified fixed-rate and modified step- rate loans, this value will be blank. Retail Broker Correspondent Third Party Origination - Not Specified 9 Not Available String 1 L-034 Property State The abbreviation denoting the location of the property securing the loan. See Appendix String 2 L-035 Seller Name The name of the entity that sold the loan to the issuer. String 100 Will not be updated after issuance, regardless of mergers or acquisitions. Will no longer be compressed with entity city and state and may also include punctuation and spaces. L-036 Servicer Name The name of the entity that services the loan during the current reporting period. String 100 Will no longer be compressed with entity city and",
        "page_15": "15 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes state and may also include punctuation and spaces. L-037 Mortgage Insurance Percent The percentage of mortgage insurance coverage obtained at origination in effect at the time the security was issued. 000 No MI 999 Not Available String 3 If value 0 or 55, then the percentage is considered not available. If MI is cancelled or expired, the value will be 0 in the monthly file. L-038 Mortgage Insurance Cancellation Indicator The indicator denoting whether the mortgage insurance has been cancelled after the security was issued. Yes No 7 Not Applicable String 1 L-039 Government Insured Guarantee The classification describing the Government Insured Guarantee Program, if any, covering the loan. FH FHA VA Veterans Affair RH Rural Housing IH Section 184 Indian Home 99 Not Available String 2 Government Insured Guarantee loans. L-040 Assumability Indicator The indicator denoting whether the loan is assumable by another borrower. Yes No String 1 L-041 Interest Only Loan Indicator The indicator denoting whether the loan only requires interest payments for specified period beginning with the first payment date. Yes No String 1 L-042 Interest Only First Principal and Interest Payment Date For interest-only loans, the month and year that the first monthly scheduled fully amortizing principal and interest payment is due. Date MMCC YY 6 L-043 Months to Amortization For interest-only loans, the number of months from the current month to the first scheduled principal and interest payment date. Numeric 3 L-044 Prepayment Penalty Indicator The indicator denoting whether the borrower is subject to penalty for early payment of principal. Yes No String 1 L-045 Prepayment Penalty Total Term The total number of months that the prepayment penalty may be in effect. 06 6 Months 12 1 Year 24 2 Years 36 3 Years 99 Not Available String 2 If Prepayment Penalty Indicator Y, value will be set to 99 L-046 Index For adjustable-rate loans, the description of the index on which adjustments to the interest rate are based. See Appendix String 3 As of 8 28 17, the Index description string will no longer be disclosed, only the index code see Appendix A.",
        "page_16": "16 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-047 Mortgage Margin For adjustable-rate loans, the number of percentage points to be added to the index to arrive at the new interest rate. 77.777 - Not Applicable Numeric 2.3 6 L-048 MBS PC Margin For adjustable-rate loans, the mortgage margin less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 L-049 Interest Rate Adjustment Frequency For adjustable-rate loans, the number of months, excluding any fixed-rate period, between scheduled rate changes. Numeric 3 L-050 Interest Rate Lookback For adjustable-rate loans, the number of calendar days prior to the rate change date used to determine the effective index value required to calculate the next interest rate. Numeric 3 L-051 Interest Rate Rounding Method For adjustable-rate loans, the designation of how the interest rate is rounded when new interest rate is calculated. DN Down NE Nearest UP Up NO No Rounding String 2 Set to NE L-052 Interest Rate Rounding Method Percent For adjustable-rate loans, the percentage to which the interest rate is rounded when new interest rate is calculated. 01 0.25 02 0.125 03 .01 String 2 Set to 02 L-053 Convertibility Indicator The indicator denoting whether the loan has feature that allows the borrower to convert from an adjustable rate to fixed rate. Yes No String 1 Adjustable-rate mortgages only L-054 Initial Fixed Rate Period For adjustable-rate loans, the number of calendar months between the first full month the loan accrues interest and the first interest rate change date. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months String 2",
        "page_17": "17 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-055 Next Interest Rate Adjustment Date For adjustable-rate loans, the month and year that the interest rate is next subject to change. Date MMCC YY 6 L-056 Months to Next Interest Rate Adjustment Date For adjustable-rate loans, the number of months from the current month to the next interest rate change date. Numeric 3 L-057 Life Ceiling Interest Rate For adjustable-rate loans, the lifetime maximum interest rate. 77.777 - Not Applicable Numeric 2.3 6 L-058 Life Ceiling Net Interest Rate For adjustable-rate loans, the maximum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 L-059 Life Floor Interest Rate For adjustable-rate loans, the lifetime minimum interest rate. 77.777 - Not Applicable Numeric 2.3 6 L-060 Life Floor Net Interest Rate For adjustable-rate loans, the minimum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 L-061 Initial Interest Rate Cap Up Percent For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at the first interest rate change date. 77.777 - Not Applicable Numeric 2.3 6 L-062 Initial Interest Rate Cap Down Percent For adjustable-rate loans, the maximum number of percentage points the interest rate can adjust downward at the first interest rate change date. 77.777 - Not Applicable Numeric 2.3 6 L-063 Periodic Interest Rate Cap Up Percent For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at each interest rate change date after the first interest rate change date. 77.777 - Not Applicable Numeric 2.3 6 L-064 Periodic Interest Rate Cap Down Percent For adjustable-rate loans, the maximum percentage points the interest rate can adjust downward at each interest rate change date after the first interest rate change date. 77.777 - Not Applicable Numeric 2.3 6 L-065 Modification Program For reperforming, modified fixed-rate and modified step- rate loans, the program under which the loan was modified. Alternative HAMP Backup Classic Payment Deferral Extend Flex HAMP Other Cap and Extend Regular Standard Streamlined Underwater 9 Not Available String 1 Effective beginning 9 21 2020",
        "page_18": "18 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-066 Modification Type For reperforming, modified fixed-rate and modified step- rate loans, the classification describing the type of modification. Rate Term Capitalization Deferred Amount Rate, Term Deferred Amount Other Rate Term Rate Deferred Amount Term Deferred Amount String 1 Effective beginning 9 21 2020 L-067 Number of Modifications For reperforming, modified fixed-rate and modified step- rate loans, the number of times the loan has been modified, at the time security was issued. Numeric 3 L-068 Total Capitalized Amount For reperforming, modified fixed-rate and modified step- rate loans, the amount of interest and non-interest arrearages added to the principal balance as of the most recent modification. Numeric 9.2 12 L-069 Interest Bearing Mortgage Loan Amount For reperforming, modified fixed-rate and modified step- rate loans, the interest bearing unpaid principal balance at the time of modification. Numeric 9.2 12 Privacy Masking Round to nearest thousand if 500 L-070 Original Deferred Amount For reperforming, modified fixed-rate and modified step- rate loans, the non-interest bearing unpaid principal balance at the time of modification. The deferred amount is not included in the unpaid principal balance of the security and is not payable to the certificate holder. Numeric 9.2 12 Privacy Masking Round to nearest thousand if 500 L-071 Current Deferred UPB For reperforming, modified fixed-rate and modified step- rate loans, the current non- interest bearing unpaid principal balance. The deferred amount is not included in the unpaid principal balance of the security and is not payable to the certificate holder. Numeric 9.2 12 Privacy Masking Round to nearest thousand if 500",
        "page_19": "19 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-072 Loan Age as Of Modification For reperforming, modified fixed-rate and modified step- rate loans, the number of scheduled payments from the time the loan was originated up to the date of modification. Numeric 3 L-073 Estimated Loan- To-Value ELTV For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the ratio obtained by dividing the outstanding balance of the mortgage loan by the estimated current value of the property obtained by the issuer, at the time of issuance. 999 Not Available Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 L-074 Updated Credit Score For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the most recently available standardized credit score provided at the time of issuance. 9999 Not Available Numeric 4 If value 300 or 850, then the score is considered not available L-075 FILLER L-076 Interest Rate Step Indicator The indicator denoting whether the modification includes step rate. Yes No String 1 L-077 Initial Step Fixed-Rate Period For reperforming, modified step-rate loans, the number of months between the first payment date of the modified loan and the first step rate adjustment date. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months Numeric 3 L-078 Total Number of Steps For reperforming, modified step-rate loans, the number of upward interest rate adjustments per the modification agreement. Numeric 2",
        "page_20": "20 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-079 Number of Remaining Steps For reperforming, modified step-rate loans, the number of upward interest rate adjustments remaining. Numeric 2 L-080 Next Step Rate For reperforming, modified step-rate loans, the scheduled interest rate in effect at the next step-rate date. Numeric 2.3 6 L-081 Terminal Step Rate For reperforming, modified step-rate loans, the maximum interest rate in effect following the final scheduled interest rate adjustment date. Once the interest rate reaches the Terminal Step Rate, it is fixed for the remaining term of the mortgage. Numeric 2.3 6 L-082 Terminal Step Date For reperforming, modified step-rate loans, the final scheduled date on which the mortgage interest rate is scheduled to increase to its terminal step rate. Date MMCC YY 6 L-083 Step Rate Adjustment Frequency For reperforming, modified step-rate loans, the number of months between each interest rate adjustment. Numeric 3 L-084 Next Step Rate Adjustment Date For reperforming, modified step-rate loans, the month and year that the interest rate is scheduled to increase. Date MMCC YY 6 L-085 Months to Next Step Rate Adjustment Date For reperforming, modified step-rate loans, the number of months from the current month to the next date on which the mortgage interest rate increases. Numeric 3 L-086 Periodic Step Cap Up Percent For reperforming, modified step-rate loans, the maximum percentage points the interest rate may increase at each step rate adjustment date. Numeric 2.3 6 L-087 Origination Mortgage Loan Amount For reperforming, modified fixed-rate and modified step- rate loans, the dollar amount of the loan in the security as stated on the note at the time the loans were originated or modified. Numeric 9.2 12 Privacy Masking Round to nearest thousand if 500 L-088 Origination Interest Rate For reperforming, modified fixed-rate and modified step- rate loans, the interest rate of the loan as stated on the note at the time the loan was originated. Numeric 2.3 6 If value 0 or 25, then the rate is considered not available securities issued on or after 9 1 2017 ",
        "page_21": "21 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-089 Origination Amortization Type For reperforming, modified fixed-rate and modified step- rate loans, the classification of the loan as having either fixed- or an adjustable- interest rate as stated on the note at the time the loan was originated. FRM Fixed-Rate ARM Adjustable- Rate String 3 L-090 Origination Interest Only Loan Indicator For reperforming, modified fixed-rate and modified step- rate loans, the indicator denoting whether the loan only required interest payments for specified period beginning with the first payment date as stated on the note at the time the loan was originated. Yes No String 1 L-091 Origination First Payment Date For reperforming, modified fixed-rate and modified step- rate loans, the month and year that the first scheduled payment on the loan was due as stated on the note at the time the loan was originated. Date MMCC YY 6 L-092 Origination Maturity Date For reperforming, modified fixed-rate and modified step- rate loans, the month and year in which the final payment on the loan was scheduled to be made at the time the loan was originated. Date MMCC YY 6 L-093 Origination Loan Term For reperforming, modified fixed-rate and modified step- rate loans, the number of months in which regularly scheduled borrower payments are due as stated on the note at the time the loan was originated. Numeric 3 L-094 Origination Loan-To-Value LTV For reperforming, modified fixed-rate and modified step- rate loans, the ratio, expressed as percentage, obtained by dividing the amount of the loan at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. 999 Not Available Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 ",
        "page_22": "22 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-095 Origination Combined Loan-To-Value CLTV For reperforming, modified fixed-rate and modified step- rate loans, the ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. 999 Not Available Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 L-096 Origination Debt-To-Income Ratio For reperforming, modified fixed-rate and modified step- rate loans, the ratio obtained by dividing the total monthly debt expense by the total monthly income of the borrower at the time the loan was originated. 999 Not Available Numeric 3 If value 1 or 65, then the ratio is considered not available L-097 Origination Credit Score For reperforming, modified fixed-rate and modified step- rate loans, the standardized credit score used to evaluate the borrower during the loan origination process. 9999 Not Available Numeric 4 If value 300 or 850, then the score is considered not available L-098 FILLER L-099 FILLER L-100 FILLER L-101 Origination Loan Purpose For reperforming, modified fixed-rate and modified step- rate loans, the classification of the loan as either purchase money mortgage or refinance mortgage at the time the loan was originated. Refinance - Cash Out Refinance - No Cash Out Refinance - Not Specified Purchase 9 Not Available String 1 L-102 Origination Occupancy Status For reperforming, modified fixed-rate and modified step- rate loans, the classification describing the property occupancy status at the time the loan was originated. Primary Residence Second Home Investment Property 9 Not Available String 1 L-103 Origination Channel For reperforming, modified fixed-rate and modified step- rate loans, the origination channel used by the party that delivered the loan to the issuer. Retail Broker Correspondent Third Party Origination - Not Specified 9 Not Available String 1",
        "page_23": "23 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-104 Days Delinquent The number of days for which mortgage loan has been reported delinquent. 0 Current 1 30-59 2 60-89 3 90-119 4 120-149 5 150-179 6 180-209 7 210-239 8 240-269 9 270-299 10 300-329 11 330-359 12 360-389 13 390-419 14 420-449 15 450-479 16 480-509 17 510-539 18 540-569 19 570-599 20 600-629 21 630-659 22 660-689 23 690-719 24 720 Numeric 2 Applicable for monthly disclosure only L-105 Loan Performance History For reperforming, modified and modified step-rate loans, the coded string of values that describes the previous payment performance of the loan at the time of issuance. This string will contain 36 months of history for reperforming modified and modified step rate loans and 12 months for reinstated loans. 0 Current 1 30-59 2 60-89 3 90-119 4 120-149 5 150-179 6 180-209 7 210-239 8 240-269 9 270-299 10 300-329 11 330-359 12 360-389 13 390-419 14 420-449 15 450-479 16 480-509 17 510-539 18 540-569 19 570-599 20 600-629 21 630-659 22 660-689 23 690-719 24 720 XX Unknown YY Not Expected String 150 Applicable only for Issuance Disclosure. The most recently reported activity is reported in the last two positions in the string. Unknown represents when loan payment is not available, or activity is not reported by servicer. Not Expected represents when payment is not due e.g. month prior to first payment date L-106 Loan Participation Percent The percentage of the loan that is contributing to the security Numeric 3.2 6 Populated for loans backing securities issued on or after 10 1 2017 Date Effective 7 2 2018",
        "page_24": "24 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-107 Property Valuation Method Indicates the method by which the value of the subject property was obtained. Appraisal - The property value was obtained through an appraisal that was completed by licensed or certified appraiser. Appraisal Waiver - The appraisal is waived per applicable Selling Guide or negotiated terms. Appraisal waiver granted under Freddie Mac Automated Collateral Evaluation ACE program. Commingled Supers may contain loans with appraisal waivers granted under Fannie Mae Property Inspection Waiver PIW program. Appraisal Waiver plus Property Data Collection - Value - The appraisal is waived with the requirement that certain property data is collected onsite by licensed or certified appraiser or trained data collector and used in proprietary automated valuation model AVM to validate the value of the property. String 1 Disclosure is effective beginning with loans backing pools issued as June 1, 2017. Appraisal Waiver plus Property Data Collection Condition is effective beginning June 20, 2023. Prior to Sept 2023, represents Onsite Property Data Collection . Effective Sept 2023, represents Appraisal Waiver plus Property Data Collection Value .",
        "page_25": "25 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes Appraisal Waiver plus Property Data Collection Condition The appraisal is waived with the requirement that certain property data is collected onsite by licensed or certified appraiser or trained data collector to ensure that the condition of the property meets the GSEs requirements but is not used to validate value of the property. GSE Targeted Refinance Programs - The programs implemented by the GSEs for targeted refinance products. Includes Relief Refinance and Enhanced Relief Refinance program loans. Commingled Supers may contain Fannie Mae Refi Plus or High LTV Refinance loans. Other - Any property valuation method not provided within the other enumerations. Not Available 9 - The Property Valuation Method is not available for disclosure. Default value for loans backing pools issued prior to June 1, 2017. Not Applicable 7 - The Property Valuation Method is not applicable to the loan product. The",
        "page_26": "26 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes disclosure is not applicable for modified fixed- rate and step-rate loans. L-108 Alternative Delinquency Resolution Loss mitigation solution that resolves delinquencies and helps homeowners remain in their homes in accordance with the servicer contractual obligation, while allowing the loan to remain in the security. Payment Deferral - For borrowers who have resolved temporary hardship and can resume making their monthly mortgage payment but cannot afford either full reinstatement or repayment plan to bring the loan current. At least two and up to six months of past due principal and interest I payments can be deferred, as well as out-of-pocket escrow advances paid to third parties, and servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The borrower may not defer more than 12 months of cumulative past- due I payments over the life of the loan. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity, or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or String 1 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. Discloses the latest ADR plan completed by the borrower. Not applicable - Loan never had payment deferral. Updates to the standard Payment Deferral were effective for implementation starting July 1, 2023, with mandatory implementation by October 1, 2023. Previously, the borrower could defer only up to two months of missed principal and interest I payments.",
        "page_27": "27 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes payoff of the interest-bearing UPB. COVID-19 Payment Deferral - For borrowers who experienced COVID-19 related hardship and can resume making their monthly mortgage payment. Up to 18 months of missed I payments can be deferred, as well as out-of- pocket escrow advances paid to third parties servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or payoff of the interest-bearing UPB. Disaster Payment Deferral - For borrowers who experienced disaster related hardship and can resume making their monthly mortgage payment. Up to 12 months of missed I payments can be deferred, as",
        "page_28": "28 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes well as out-of- pocket escrow advances paid to third parties servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or payoff of the interest-bearing UPB. Other - The borrower has executed an Alternative Delinquency Resolution program other than the other provided enumerations. Not Applicable 7 An Alternative Delinquency Resolution is not applicable for the related mortgage loan. Not Available 9 The Alternative Delinquency Resolution is not available for disclosure.",
        "page_29": "29 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes L-109 Number of Alternative Delinquency Resolutions The total number of Alternative Delinquency Resolutions as reported by the servicer for specific loan. 0-99 Numeric 2 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. L-110 Total Deferral Amount The total non-interest-bearing deferral amount related to one or more Alternative Delinquency Resolutions. For modified loans, this may include additional non- interest-bearing deferral amounts related to prior modification. Numeric 9.2 12 Privacy Masking Round to nearest thousand if 500 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. This amount represents the current deferred amount. L-111 Borrower Assistance Plan The type of assistance plan that the borrower is enrolled in that provides temporary mortgage payment relief or an opportunity to cure mortgage delinquency over defined period. Loans that are in review for modification, repayment plan or payment deferral offer will be included as part of the Forbearance disclosure until the borrower accepts, declines or is determined to be ineligible for workout plan. Forbearance Plan Repayment Plan Trial Period Plan Other Workout Plan No Workout Plan 7 Not Applicable 9 Not Available String 1 Applicable for monthly disclosure only. This attribute will be published on one-month delay due to the timing of our servicing reporting cycle. For example, the values in this attribute published in July 2020 correspond to the delinquency status in the Days Delinquent attribute published in June 2020. L-112 Seller City The city of the address of the entity that sold the loan to the issuer. String 50 Unavailable data will be populated as NULL. L-113 Seller State The state or territory of the address of the entity that sold the loan to the issuer. String 2 Unavailable data will be populated as NULL. L-114 Servicer City The city of the address of the entity that services the loan. String 50 Unavailable data will be populated as NULL. L-115 Servicer State The state or territory of the address of the entity that services the loan. String 2 Unavailable data will be populated as NULL. L-116 Special Eligibility Program mortgage program with expanded eligibility criteria designed to increase and maintain home ownership. Home Possible HomeReady An affordable mortgage program designed String 1 As of July 2019, Home Possible eligibility generally requires that borrowers earn",
        "page_30": "30 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes for eligible, creditworthy borrowers. HFA Advantage HFA Preferred An affordable, conventional mortgage program available exclusively to housing financing agencies HFAs to maximize financing to eligible low-to moderate-income borrowers. Refi Possible RefiNow An affordable refinance program designed for eligible, creditworthy borrowers with an existing Freddie Mac-owned mortgage. Other special eligibility program not provided within the other enumerations. Not Applicable 7 The special eligibility program disclosure is not applicable to the related loan. Default value for all modified loans and Home Possible HomeReady loans backing pools issued prior to 1 1 2016. Not Available 9 The special eligibility program disclosure is not available for the related loan. 80 or less of the area median income AMI limit. Prior to that date, Home Possible eligibility generally required that borrowers earn 100 or less of the AMI limit, with certain exceptions for higher cost areas. Populated for issuance disclosure beginning 8 16 2021 if applicable and for monthly disclosure beginning 9 7 2021.",
        "page_31": "31 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SECURITY LEVEL FILE",
        "page_32": "32 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files The daily security level issuance file contains security level data including the pool factor and weighted averages for the mortgage- backed securities, including single-class resecuritizations. Information is provided as of the time of the issuance of the security. The monthly security level file has the same file layout. The monthly security level file provides updated information calculated based on the mortgage information reported to Freddie Mac by servicers. The same mortgage information is used by Freddie Mac to calculate monthly pool factors for the month in which the disclosure is provided. This data should be considered in conjunction with the information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The security data file includes the attribute names, definitions, enumerations, data types, formats, max lengths and implementation notes. In the case of single-class resecuritizations, information on the collateral backing the single-class securitization will be provided. Freddie Mac will publish three daily security files each business day in the morning and three monthly security level files. Most of Freddie Mac securities will be in one file, but we will publish second security file with the data for the following securities Adjustable-Rate Mortgages ARM , Modified, Reinstated 75-Day payment delay Fixed-Rate PC securities. ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-01 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 S-02 Security Identifier The unique designation assigned to the security by the issuer. String 6 S-03 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 S-04 Security Factor Date The month and year on which the corresponding factor is effective. Date MMCCYY 6 S-05 Security Factor The decimal value that, when multiplied by the Issuance Investor Security UPB amount, equals the Current Investor Security UPB amount. Numeric 1.8 10 Rounded to the 8th decimal For 55-Day Mirror Exchanges, the Security Factor will be 1 in the Daily Issuance files. S-06 Payment Delay Days The indicator used to denote that the loans in the security participate in 45 Day, 55 Day, or 75 Day payment delay period at the time the security was issued. 45 45 Days 55 55 Days 75 75 Days Numeric 2 S-07 Security Data Correction Indicator The indicator used to denote the data correction status of the security based on the current reporting period. Yes No String 1 Applicable at Issuance Monthly Disclosure S-08 Security Status Indicator The indicator used to denote the status of the security based on the current reporting period. Active Paid Off Collapsed Dissolved String 1 S-09 Security Notification Indicator The indicator used to denote whether the disclosure is preliminary and subject to change or final. Preliminary Final 7 Not Applicable String 1 Applicable at Issuance Monthly Disclosure",
        "page_33": "33 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-10 Security Description The unique designation of the security including abbreviated FED CODE, WA Net Interest Rate, Prefix and Security Identifier. String 22 Security Description The unique designation of the security including abbreviated FED CODE, WA Net Interest Rate, Prefix and Security Identifier. String 23 For Pseudopools only S-11 Issuer The name of the entity that issued the security. FNM Fannie Mae FRE Freddie Mac String 3 S-12 Issue Date The date on which the security was issued. Date MMDDCC YY 8 Day value will be defaulted to 01 S-13 Maturity Date The month and year in which the final payment on the security is scheduled to be made at the time the security was issued. Date MMCCYY 6 S-14 Updated Longest Maturity Date The updated month and year in which the final payment on the security is scheduled to be made based on the longest maturity date of the remaining loans in the security. Date MMCCYY 6 Updated monthly, based on the longest loan level maturity date S-15 Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Numeric 14.2 17 Truncated to whole number S-16 Current Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the current balance of the security. Numeric 14.2 17 For 55-Day Mirror Exchanges, at issuance, the Current Investor Security UPB will be set to the current UPB of the underlying 45-day PC. S-17 WA Net Interest Rate The weighted average interest rate of the loans less servicing fees and guarantor fees. Numeric 2.3 6 Rounded to the 3rd decimal WA Net Interest Rate The weighted average interest rate of the loans less servicing fees and guarantor fees. Numeric 2.5 8 Rounded to the 5th decimal For Pseudopools only S-18 WA Issuance Interest Rate The weighted average interest rate of the loans in effect at the time the security was issued. Numeric 2.3 6 Rounded to the 3rd decimal S-19 WA Current Interest Rate The weighted average interest rate of the loans Numeric 2.3 6 Rounded to the 3rd decimal Not applicable for Freddie Mac ARM",
        "page_34": "34 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes in effect during the current reporting period. For 55-Day Mirror Exchanges, at issuance, the WA Current Interest Rate will be set to the WA Current Interest Rate of the underlying 45- day PC. S-20 WA Net Accrual Interest Rate For adjustable-rate loans, the weighted average Interest Rate less servicing fees and guarantor fees. Numeric 2.3 6 Rounded to the 3rd decimal Not applicable for Freddie Mac ARMs S-21 WA Loan Term The weighted average number of months in which regularly scheduled borrower payments are due. Numeric 3 S-22 WA Issuance Remaining Months to Maturity The weighted average number of scheduled monthly payments that will reduce the Investor Loan UPB to zero, at the time the security was issued. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 S-23 WA Current Remaining Months to Maturity The weighted average number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 For 55-Day Mirror Exchanges, at issuance, the WA Current RMM will be set to the WA Current RMM of the underlying 45-day PC. Value can be negative S-24 WA Loan Age The weighted average number of scheduled payments from the time the loans were originated or modified up to and including the current reporting period. Numeric 3 Rounded to nearest integer Value can be negative S-25 WA Mortgage Loan Amount The weighted average dollar amount of the loans as stated on the notes at the time the loans were originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal",
        "page_35": "35 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-26 Average Mortgage Loan Amount The simple average dollar amount of the loans as stated on the notes at the time the loans were originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal S-27 WA Loan-To-Value LTV The weighted average ratio, expressed as percentage, obtained by dividing the amount of the loans at origination by the value of the properties. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-28 WA Combined Loan- To-Value CLTV The weighted average ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the properties. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-29 WA Debt-To-Income DTI The weighted average ratio obtained by dividing the total monthly debt expenses by the total monthly incomes of the borrowers at the time the loans were originated or modified. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 65, then the ratio is considered not available",
        "page_36": "36 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-30 WA Borrower Credit Score The weighted average standardized credit score used to evaluate the borrower during the loan origination process. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 9999 Not Available Numeric 4 Rounded to the nearest integer If value 300 or 850, then the score is considered not available S-31 FILLER S-32 FILLER S-33 Loan Count The total number of loans in the security. Numeric 9 S-34 Third Party Origination UPB Percent The percentage of the aggregate Investor Loan UPB that were originated by third party, to include Broker and Correspondent originations. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Numeric 3.2 6 Rounded to the 2nd decimal S-35 Seller Name The name of the entity that sold the loans to the issuer. String 100 For Multilenders this field will be MULTIPLE For Giants, this field will be SCR Single-Class Resecuritization For 55-day Mirror Exchanges, this field will be SCR- MIRROR Field will not be updated after issuance, for mergers and acquisitions S-36 Seller City The city of the address of the entity that sold the loans to the issuer. String 50 For Multilenders and Giants, this field will be blank. S-37 Seller State The state or territory of the address of the entity that sold the loans to the issuer. String 2 For Multilenders and Giants this field will be blank.",
        "page_37": "37 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-38 Servicer Name The name of the entity that services the loan during the current reporting period. String 100 For Multilenders this field will be MULTIPLE For Giants, this field will be SCR Single-Class Resecuritization - For 55-day Mirror Exchanges, this field will reflect SCR-MIRROR Field will not be updated after issuance, regardless of mergers and acquisitions. S-39 Servicer City The city of the address of the entity that services the loan. String 50 For Multilenders and Giants, this field will be blank S-40 Servicer State The state or territory of the address of the entity that services the loan. String 2 For Multilenders and Giants this field will be blank S-41 Involuntary Loan Purchases Prior Month UPB Formerly Known As Delinquent Loans Purchased Prior Month UPB The aggregate prior period Investor Loan UPB of the loans that were removed from the security due to involuntary reasons during the current reporting period. Involuntary reasons include loan delinquencies, loss mitigation efforts and lender repurchases. Numeric 14.2 17 Monthly Security file only Effective June 2019 BD4 Attribute label will be updated after June 2019 S-42 Involuntary Loan Purchases Loan Count Formerly Known As Delinquent Loans Purchased Loan Count The number of loans that were removed from the security due to involuntary reasons during the current reporting period. Involuntary reasons include loan delinquencies, loss mitigation efforts and lender repurchases. Numeric 9 Monthly Security file only Effective June 2019 BD4 Attribute label will be updated after June 2019 S-43 Eligible for Resecuritization The indicator used to denote that the security is eligible for resecuritization. Yes No String 1 S-44 Notes Additional information about the loans in the security. String 2048 S-45 Notes Ongoing Additional information about the loans in the security. String 2048 Monthly Security file only S-46 Interest Only Security Indicator The indicator denoting whether the loans only require interest payments for specified period beginning with the first payment date. Yes No String 1",
        "page_38": "38 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-47 WA Months to Amortization For interest-only loans, the weighted average number of months from the current month to the first scheduled principal and interest payment date. Numeric 3 Rounded to nearest whole number If Interest Only Security Indicator S-48 Prepayment Penalty Indicator The indicator denoting whether the security is subject to penalty for early payment of principal. Yes No 5 Mixed 9 Not Available String 1 S-49 Reduced Minimum Servicing Indicator The indicator denoting whether the loans in the security may have reduced servicing fee. Yes No 9 Not Available String 1 S-50 Subtype For an adjustable-rate mortgage, the code that identifies ARM product characteristics and features. String 20 Not applicable for Freddie Mac ARMs S-51 Index For adjustable-rate loans, the description of the index on which adjustments to the interest rate are based. See Appendix String 3 As of 8 28 17, the Index description string will no longer be disclosed, only the index code see Appendix A. S-52 WA Mortgage Margin For adjustable-rate loans, the weighted average number of percentage points to be added to the index to arrive at the new interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal place Issuance value will be populated in the monthly files. S-53 WA MBS PC Margin For adjustable-rate loans, the weighted average mortgage margin less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal place If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation. S-54 Interest Rate Adjustment Frequency For adjustable-rate loans, the number of months, excluding any fixed-rate period, between scheduled rate changes. 55.555 Mixed Numeric 3 S-55 Interest Rate Lookback For adjustable-rate loans, the number of calendar days prior to the interest rate change date used to determine the effective index value required to calculate the next interest rate. 55.555 Mixed Numeric 3 S-56 Payment Adjustment Frequency For adjustable-rate loans, the number of months between scheduled payment changes. For security with an initial fixed-rate period, the payment adjustment frequency is the number of months between subsequent payment changes. 555 Mixed Numeric 3",
        "page_39": "39 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-57 Payment Lookback For negative amortizing adjustable-rate loans, the number of days prior to payment effective date used to determine value when calculating principal and interest payment. Numeric 3 S-58 Convertibility Indicator For adjustable-rate loans, the indicator denoting whether the loans in the security have feature that allows the borrower to convert from an adjustable rate to fixed rate. Yes No 9 Not Available String 1 S-59 Negative Amortization Indicator For adjustable-rate loans, the indicator used to denote that the loans in the security allow negative amortization. Yes No 9 Not Available String 1 S-60 Negative Amortization Factor For negative amortizing adjustable-rate loans, the decimal value that, when multiplied by the Issuance Investor Security UPB amount, equals the Negative Amortization amount. Numeric 1.8 10 Rounded to the 8th decimal place If Negative Amortization Indicator S-61 WA Negative Amortization Limit For negative amortizing adjustable-rate loans, the weighted average Negative Amortization Limit of the loans in the security. 99.999 Not Available Numeric 2.3 6 Not applicable to Freddie Mac ARMs S-62 Initial Fixed Rate Period For adjustable-rate loans, the number of calendar months between the first full month the loans accrue interest and the first interest rate change date. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months 55 Mixed String 2 S-63 First Rate Adjustment Date For adjustable-rate loans, the earliest First Rate Adjustment Date of the loans in the security. Date MMCCYY 6 Not applicable for Freddie Mac ARMs S-64 First Payment Adjustment Date For adjustable-rate loans, the earliest First Payment Adjustment Date of the loans in the security. Date MMCCYY 6 Not applicable for Freddie Mac ARMs",
        "page_40": "40 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-65 WA Months to Next Rate Adjustment Date For adjustable-rate loans, the weighted average number of months from the current month to the next interest rate change date. Numeric 3 Rounded to nearest whole number S-66 WA Life Interest Rate Ceiling For adjustable-rate loans, the weighted average lifetime maximum interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal Issuance value will be populated in the monthly files. If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-67 WA Net Life Interest Rate Ceiling For adjustable-rate loans, the weighted average maximum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-68 WA Life Interest Rate Floor For adjustable-rate loans, the weighted average lifetime minimum interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal Issuance field, will be populated with 77.777 in monthly files. If any loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-69 WA Net Life Interest Rate Floor For adjustable-rate loans, the weighted average minimum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal If any loan level value 77.777, set value to 77.777 else exclude from weighted average calculation S-70 Initial Interest Rate Cap Up For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-71 Initial Interest Rate Cap Down For adjustable-rate loans, the maximum percentage points the interest rate can adjust downward at the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-72 Periodic Interest Rate Cap Up For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at each interest rate change date after the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-73 Periodic Interest Rate Cap Down For adjustable-rate loans, the maximum percentage points the interest rate can adjust downward at each interest rate change date after the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6",
        "page_41": "41 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-74 Initial Step Fixed- Rate Period For reperforming, modified step-rate loans, the number of months between the first payment date of the modified loan and the first step rate adjustment. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months 55 Mixed String 2 S-75 Step Rate Adjustment Frequency For reperforming, modified step-rate loans, the number of months between each interest rate adjustment. 555 Mixed Numeric 3 S-76 Next Step Rate Adjustment Date For reperforming, modified step-rate loans, the month and year that the interest rate is scheduled to increase. Date MMCCYY 6 S-77 WA Months to Next Step Rate Adjustment For reperforming, modified step-rate loans, the weighted average number of months from the current month to the next date on which the mortgage interest rate increases. Numeric 3 Rounded to whole number S-78 Periodic Step Rate Cap Up For reperforming, modified step-rate loans, the maximum percentage points the interest rate may increase at each step rate adjustment date. 55.555 Mixed Numeric 2.3 6 S-79 WA Origination Mortgage Loan Amount For reperforming, modified fixed-rate and modified step-rate loans, the weighted average dollar amount of the loans in the security as stated on the notes at the time the loans were originated. Numeric 9.2 12 Rounded to the 2nd decimal S-80 Average Origination Mortgage Loan Amount For reperforming, modified fixed-rate and modified step-rate loans, the simple average dollar amount of the loans in the security as stated on the notes at the time the loans were originated. This value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal",
        "page_42": "42 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-81 WA Origination Interest Rate For reperforming, modified fixed-rate and modified step-rate loans, the weighted average interest rate of the loans as stated on the note at the time the loans were originated. Numeric 2.3 6 Rounded to the 3rd decimal S-82 WA Origination Loan Term For reperforming, modified fixed-rate and modified step-rate loans, the weighted average number of months in which regularly scheduled borrower payments are due as stated on the note at the time the loans were originated. Numeric 3 S-83 WA Origination Loan-To-Value LTV For reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio, expressed as percentage, obtained by dividing the amount of the loans at origination by the values of the properties. Property values reflect either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-84 WA Origination Combined Loan-To- Value CLTV For reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the property. Property values reflect either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. Numeric 3 If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-85 WA Origination Debt-To-Income DTI For reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio obtained by dividing the total monthly debt expense by the total monthly income of the borrower at the time the loan was originated. Numeric 3 If value 1 or 65, then the ratio is considered not available",
        "page_43": "43 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-86 WA Origination Credit Score For reperforming, modified fixed-rate and modified step-rate loans, the weighted average standardized credit score used to evaluate the borrower during the loan origination process. Numeric 4 If value 300 or 850, then the score is considered not available S-87 FILLER S-88 FILLER S-89 Origination Third Party Origination UPB Percent For reperforming, modified fixed-rate and modified step rate loans, the percentage of the aggregate Investor Loan UPB that was originated by third party, to include Broker and Correspondent originations. Numeric 3.2 6 S-90 WA Estimated Loan- To-Value ELTV For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio obtained by dividing the outstanding balance of the mortgage loan by the estimated current value of the property obtained by the issuer, at the time of issuance. Numeric 3 If value 1 or 998, then the ratio is considered not available only applicable to securities issued on or after 9 1 2017 S-91 WA Updated Credit Score For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average most recently available standardized credit score provided at the time of issuance. Numeric 4 If value 300 or 850, then the score is considered not available S-92 Mission Density Score The mission density score MDS is score representing the number of Mission Dimensions for which each mortgage loan qualifies. See the Mission Index Guide for additional definition information and for calculations. Attribute previously named Social Density Score SDS . 7.77 - Not Applicable 9.99 Not Available Numeric 1.2 4 Pools issued prior to 1 1 2010 default to 9.99 The maximum score will be 2.5 to minimize privacy concerns in cases where all 3 criteria are met The pool must have 10 loans that are either primary home or investment property at the time of issuance to generate an MDS score, otherwise default to 7.77 S-93 Mission Criteria Share The mission criteria share MCS is the percentage of loans in security that satisfies at least one Mission Dimension. 777.77 - Not Applicable 999.99 Not Available Numeric 3.2 6 Pools issued prior to 1 1 2010 default to 999.99",
        "page_44": "44 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes See the Mission Index Guide for additional definition information and for calculations. Attribute previously named Social Criteria Share SCS . The pool must have 10 loans that are either primary home or investment property at the time of issuance to generate an MCS score, otherwise default to 777.77 S-94 Green Indicator The indicator denoting whether the security is labeled Green MBS secured by loans that are eligible per Freddie Mac Green Bond Framework. Yes No String 1 The L1 pool must have 100 green eligible loans. S-95 Social Indicator The indicator denoting whether the security is labeled Social MBS secured by loans that are eligible per Freddie Mac Social Bond Framework. Yes No 9 Not Available String 1 Disclosure is effective beginning with pools issued as of June 2024. The L1 or L2 ML pool must have an MCS 100 and MDS 2.0. If the pool disclosure is in preliminary status, then the Indicator will be set to 9 Not Available. S-96 Mission Index Version The version of the Mission Index methodology used to calculate the Mission Criteria Share and the Mission Density Score. V1.0 Version 1.0 V1.1 Version 1.1 555 Mixed 777 Not Applicable String 5 Not Applicable 777 Securities issued prior to 1 2010, Reinstated or Modified securities V1.0 - Level 1 securities issued 1 2010 to 5 2024 V1.1 - Level 1 securities issued beginning 6 2024",
        "page_45": "45 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SECURITY SUPPLEMENTAL FILE",
        "page_46": "46 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files The daily security supplemental file combines several different types of records within single file. The file contains quartile information and the stratifications for the mortgage-backed securities, including single-class resecuritizations. Information is provided as of the time of the issuance of the security. The monthly security supplemental file has updated information calculated based on the mortgage information reported to Freddie Mac by servicers. This data should be considered in conjunction with the information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The security supplemental data file includes the attribute names, definitions, enumerations, data types, formats, max lengths and implementation notes. In the case of single-class resecuritizations, information on the collateral backing the single-class securitization will be provided. Freddie Mac will publish two daily security supplemental files each business day in the morning and two monthly security supplemental files. Most of Freddie Mac securities will be in one file, but we will publish second security supplemental file with the data for the following securities Adjustable-Rate Mortgages ARM , Modified, Reinstated 75- Day payment delay Fixed-Rate PC securities. To find prefixes included in each file, please refer to the Introduction section. Record Type Security Supplemental File Record Type Description 1 Quartiles 2 Next Rate Change Date NRCD 3 Loan-To-Value LTV Not Available Stratification 4 Combined Loan-To-Value CLTV Not Available Stratification 5 Debt-To-Income DTI Not Available Stratification 6 Borrower Credit Score Not Available Stratification 7 Days Delinquent Stratification 8 Number of Borrowers Stratification 9 First Time Home Buyer Stratification 10 Loan Purpose Stratification 11 Occupancy Status Stratification 12 Number of Units Stratification 13 Property Type Stratification 14 Channel Stratification 15 Property State Stratification 16 Seller Name Stratification 17 Servicer Name Stratification 18 Mortgage Insurance Coverage Stratification 19 Mortgage Insurance Cancellation Indicator Stratification 20 Government Insured Guarantee Stratification 21 Interest Only First Principal and Interest Payment Date Stratification 22 Not Paying Principal in First Distribution Stratification 23 Origination Year Stratification 24 Origination Channel Stratification 25 Non-Standard Loan Type Stratification 26 Modification Program Stratification 27 Modification Type Stratification 28 Modification Information Stratification 29 Number of Modifications Stratification 30 Deferred Unpaid Principal Balance Stratification 31 Estimated Loan-to-Value ELTV Not Available Stratification 32 Updated Credit Score Not Available Stratification 33 Number of Remaining Steps Stratification 34 Number of Steps - At Modification Stratification 35 Next Step Rate Adjustment Date Stratification 36 Origination Loan-To-Value LTV Not Available Stratification 37 Origination Combined Loan-To-Value CLTV Not Available Stratification 38 Origination Debt-To-Income DTI Not Available Stratification 39 Origination Borrower Credit Score Not Available Stratification 40 Origination Loan Purpose Stratification 41 Origination Occupancy Status Stratification 42 Borrower Payment History Stratification 43 Collateral List 44 Property Valuation Method Stratification 45 Borrower Assistance Plan Stratification 46 Alternative Delinquency Resolution Stratification 47 Number of Alternative Delinquency Resolutions Stratification 48 Borrower Assistance Plan History Stratification 49 Special Eligibility Program Stratification 50 Interest Rate Buydown Type Stratification",
        "page_47": "47 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Record Type Security Supplemental File Record Type Description 51 Green Program Criteria Stratification 52 Green Building Certification Stratification 53 Energy Rating Index Stratification 54 Renewable Energy Stratification",
        "page_48": "48 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Quartiles ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 001 Record Type 1 Quartiles String 2 SS- 002 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS- 003 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS- 004 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS- 005 Quartile Based on the Current Investor UPB for all the active loans in security, distributed across the following quartile data points MIN, 25 , MED, 75 , MAX MIN 25 MED 75 MAX String 3 SS- 006 Mortgage Loan Amount The dollar amount of the loan as stated on the note at the time the loan was originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 14.2 17 SS- 007 Interest Rate The interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 Not applicable to ARMs SS- 008 Current Net Interest Rate The interest rate of the loan in effect during the current reporting period less servicing fees and guarantor fees. Numeric 2.3 6 SS- 009 Loan Term The number of months in which regularly scheduled borrower payments are due. Numeric 3 SS- 010 Remaining Months to Maturity The number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 SS- 011 Loan Age The number of scheduled payments from the time the loan was originated and modified up to and including the current reporting period. Numeric 4",
        "page_49": "49 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Quartiles ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 012 Loan-To-Value LTV The ratio, expressed as percentage, obtained by dividing the amount of the loan at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Numeric 3 SS- 013 Combined Loan- To-Value CLTV The ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the property. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Numeric 3 SS- 014 Debt-To-Income DTI The ratio obtained by dividing the total monthly debt expense by the total monthly income of the borrower at the time the loan was originated or modified. Numeric 3 SS- 015 Borrower Credit Score The standardized credit score used to evaluate the borrower during the loan origination process. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Numeric 4 SS- 016 FILLER SS- 017 FILLER SS- 018 Updated Credit Score For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the most recently available standardized credit score provided at the time of issuance. Numeric 4",
        "page_50": "50 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Quartiles ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 019 Estimated Loan- To-Value ELTV For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the ratio obtained by dividing the outstanding balance of the mortgage loan by the estimated current value of the property obtained by the issuer, at the time of issuance. Numeric 3 Next Rate Change Date NRCD ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 020 Record Type 2 Next Rate Change Date NRCD String 2 SS- 021 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS- 022 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS- 023 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS- 024 Next Interest Rate Adjustment Date For adjustable-rate loans, the month and year that the interest rate is next subject to change. Date MMCCYY 6 SS- 025 Months to Next Interest Rate Adjustment Date For the stratified attribute of adjustable-rate loans, the number of months from the current month to the next interest rate change date. Numeric 3 Rounded to the nearest integer SS- 026 Interest Only First Principal and Interest Payment Date For the stratified attribute for interest only adjustable-rate loans, the month and year that the first monthly scheduled fully amortizing principal and interest payment is due. Date MMCCYY 6 SS- 027 Aggregate Investor Loan UPB For the stratified attribute of adjustable-rate loans, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS- 028 Percentage Investor Security UPB For the stratified attribute of adjustable-rate loans, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS- 029 Aggregate Loan Count For the stratified attribute of adjustable-rate loans, the total number of loans in the security. Numeric 9 Next Rate Change Date NRCD ",
        "page_51": "51 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 030 Percentage Loan Count For the stratified attribute of adjustable-rate loans, the percentage of loans in the security. Numeric 3.2 6 SS- 031 WA Current Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average interest rate of the loans in effect during the current reporting period. Numeric 2.3 6 Not Available SS- 032 Current High Interest Rate For the stratified attribute of adjustable-rate loans, the highest interest rate of the loans in effect during the current reporting period. Numeric 2.3 6 Not Available SS- 033 Current Low Interest Rate For the stratified attribute of adjustable-rate loans, the lowest interest rate of the loans in effect during the current reporting period. Numeric 2.3 6 Not Available SS- 034 WA Current Net Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average interest rate of the loans in effect during the current reporting period less servicing fees and guarantor fees. Numeric 2.3 6 SS- 035 Current High Net Interest Rate For the stratified attribute of adjustable-rate loans, the highest value interest rate of the loans in effect during the current reporting period less servicing fees and guarantor fees. Numeric 2.3 6 SS- 036 Current Low Net Interest Rate For the stratified attribute of adjustable-rate loans, the lowest value interest rate of the loans in effect during the current reporting period less servicing fees and guarantor fees. Numeric 2.3 6 SS- 037 WA Mortgage Margin For the stratified attribute of adjustable-rate loans, the weighted average number of percentage points to be added to the index to arrive at the new interest rate. Numeric 2.3 6 Not Available SS- 038 High Mortgage Margin For the stratified attribute of adjustable-rate loans, the highest number of percentage points to be added to the index to arrive at the new interest rate. Numeric 2.3 6 Not Available Next Rate Change Date NRCD ",
        "page_52": "52 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 039 Low Mortgage Margin For the stratified attribute of adjustable-rate loans, the lowest number of percentage points to be added to the index to arrive at the new interest rate. Numeric 2.3 6 Not Available SS- 040 WA MBS PC Margin For the stratified attribute of adjustable-rate loans, the weighted average mortgage margin less servicing fees and guarantor fees. Numeric 2.3 6 SS- 041 MBS PC Margin High For the stratified attribute of adjustable-rate loans, the highest value mortgage margin less servicing fees and guarantor fees. Numeric 2.3 6 SS- 042 MBS PC Margin Low For the stratified attribute of adjustable-rate loans, the lowest value mortgage margin less servicing fees and guarantor fees. Numeric 2.3 6 SS- 043 WA Life Ceiling Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average lifetime maximum interest rate. Numeric 2.3 6 Not Available SS- 044 Life Ceiling High Interest Rate For the stratified attribute of adjustable-rate loans, the highest value lifetime maximum interest rate. Numeric 2.3 6 Not Available SS- 045 Life Ceiling Low Interest Rate For the stratified attribute of adjustable-rate loans, the lowest value lifetime maximum interest rate. Numeric 2.3 6 Not Available SS- 046 WA Life Ceiling Net Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average maximum interest rate, less servicing fees and guarantor fees. Numeric 2.3 6 SS- 047 Life Ceiling High Net Interest Rate For the stratified attribute of adjustable-rate loans, the highest value maximum interest rate, less servicing fees and guarantor fees. Numeric 2.3 6 SS- 048 Life Ceiling Low Net Interest Rate For the stratified attribute of adjustable-rate loans, the lowest value maximum interest rate, less servicing fees and guarantor fees. Numeric 2.3 6 SS- 049 WA Life Floor Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average lifetime minimum interest rate. Numeric 2.3 6 Not Available Next Rate Change Date NRCD ",
        "page_53": "53 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS- 050 Life Floor High Interest Rate For the stratified attribute of adjustable-rate loans, the highest value lifetime minimum interest rate. Numeric 2.3 6 Not Available SS- 051 Life Floor Low Interest Rate For the stratified attribute of adjustable-rate loans, the lowest value lifetime minimum interest rate. Numeric 2.3 6 Not Available SS- 052 WA Life Floor Net Interest Rate For the stratified attribute of adjustable-rate loans, the weighted average minimum interest rate less servicing fees and guarantor fees. Numeric 2.3 6 Will be blank if any loan level 77.777 SS- 053 Life Floor High Net Interest Rate For the stratified attribute of adjustable-rate loans, the highest value minimum interest rate less servicing fees and guarantor fees. Numeric 2.3 6 Will be blank if any loan level 77.777 SS- 054 Life Floor Low Net Interest Rate For the stratified attribute of adjustable-rate loans, the highest value minimum interest rate less servicing fees and guarantor fees. Numeric 2.3 6 Will be blank if any loan level 77.777 Loan-To-Value LTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-055 Record Type 3 Loan-To-Value LTV Not Available Stratification For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. String 2 If security characteristics apply SS-056 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-057 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-058 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-059 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-060 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-061 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9",
        "page_54": "54 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Loan-To-Value LTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-062 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Combined Loan-To-Value CLTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-063 Record Type 4 Combined Loan-To-Value CLTV Not Available Stratification For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. String 2 If security characteristics apply SS-064 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-065 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-066 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-067 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-068 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-069 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-070 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Debt-To-Income DTI Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-071 Record Type 5 Debt-To-Income DTI Not Available Stratification String 2 If security characteristics apply SS-072 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-073 Security Identifier The unique designation assigned to the security by the issuer. String 6",
        "page_55": "55 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Debt-To-Income DTI Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-074 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-075 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-076 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-077 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-078 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Borrower Credit Score Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-079 Record Type 6 Borrower Credit Score Not Available Stratification Numeric 4 SS-080 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-081 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-082 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-083 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 17 SS-084 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 6 SS-085 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-086 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 6 Days Delinquent Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-087 Record Type 7 Days Delinquent Stratification String 2 Monthly disclosure",
        "page_56": "56 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-088 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-089 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-090 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-091 Days Delinquent The number of days for which mortgage loan has been reported delinquent. 0 Current 1 30-59 2 60-89 3 90-119 4 120-149 5 150-179 6 180-209 7 210-239 8 240-269 9 270-299 10 300-329 11 330-359 12 360-389 13 390-419 14 420-449 15 450-479 16 480-509 17 510-539 18 540-569 19 570-599 20 600-629 21 630-659 22 660-689 23 690-719 24 720 Numeric 2 Will represent 100 of the pool. SS-092 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-093 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-094 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-095 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Number of Borrowers Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-096 Record Type 8 Number of Borrowers Stratification String 2 SS-097 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-098 Security Identifier The unique designation assigned to the security by the issuer. String 6",
        "page_57": "57 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Number of Borrowers Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-099 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-100 Number of Borrowers The number of borrowers who, at the time the loan is originated, are obligated to repay the loan. 1 2 2 99 Not Available String 2 SS-101 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-102 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-103 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-104 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 First Time Home Buyer Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-105 Record Type 9 First Time Home Buyer Stratification String 2 SS-106 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-107 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-108 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-109 First Time Home Buyer The indicator denoting whether borrower on the loan qualifies as first-time homebuyer. Yes No 9 Not Available String 1 SS-110 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-111 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-112 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-113 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6",
        "page_58": "58 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Loan Purpose Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-114 Record Type 10 Loan Purpose Stratification String 2 SS-115 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-116 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-117 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-118 Loan Purpose The classification describing the purpose of the loan. Refinance - Cash Out Refinance - No Cash Out Refinance - Not Specified Purchase Modified - Loss Mitigation 9 Not Available String 1 SS-119 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-120 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-121 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-122 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Occupancy Status Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-123 Record Type 11 Occupancy Status Stratification String 2 SS-124 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-125 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-126 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9",
        "page_59": "59 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-127 Occupancy Status The classification describing the property occupancy status at the time the loan was originated. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Primary Residence Second Home Investment Property 9 Not Available String 1 SS-128 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-129 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-130 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-131 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Number of Units Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-132 Record Type 12 Number of Units Stratification String 2 SS-133 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-134 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-135 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-136 Number of Units The number of dwelling units in the mortgaged property at the time the loan was originated. 1 1 2 2 3 3 4 4 99 Not Available Numeric 2 SS-137 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-138 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-139 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-140 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Property Type Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes",
        "page_60": "60 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-141 Record Type 13 Property Type Stratification String 2 SS-142 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-143 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-144 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-145 Property Type The classification describing the type of property that secures the loan. CP Cooperative CO Condominium PU Planned Unit Development SF Single-Family MH Manufactured Housing 99 Not Available String 2 SS-146 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-147 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-148 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-149 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Channel Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-150 Record Type 14 Channel Stratification String 2 SS-151 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-152 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-153 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-154 Channel The origination channel used by the party that delivered the loan to the issuer. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Retail Broker Correspondent Third Party Origination - Not Specified 9 Not Available String 1",
        "page_61": "61 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-155 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-156 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-157 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-158 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Property State Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-159 Record Type 15 Property State Stratification String 2 SS-160 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-161 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-162 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-163 Property State The abbreviation denoting the location of the property securing the loan. See Appendix String 2 SS-164 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-165 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-166 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-167 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Seller Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-168 Record Type 16 Seller Name Stratification String 2 SS-169 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-170 Security Identifier The unique designation assigned to the security by the issuer. String 6",
        "page_62": "62 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Seller Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-171 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-172 Seller Name The name of the entity that sold the loan to the issuer. Will reflect servicer names contributing 1 of the Current Investor Security UPB. String 100 Will not be updated after issuance, regardless of mergers acquisitions SS-173 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-174 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-175 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-176 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 SS-177 Minimum Loan Age For the stratified attribute, the minimum number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-178 Maximum Loan Age For the stratified attribute, the maximum number of scheduled payments from the time the loan was originated or modified to and including the current reporting period. Numeric 3 SS-179 Minimum Interest Rate For the stratified attribute, the minimum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-180 Maximum Interest Rate For the stratified attribute, the maximum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-181 Minimum Remaining Months to Maturity For the stratified attribute, the minimum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-182 Maximum Remaining Months to Maturity For the stratified attribute, the maximum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3",
        "page_63": "63 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Seller Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-183 WA Loan Age For the stratified attribute, the weighted average number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-184 WA Interest Rate For the stratified attribute, the weighted average interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-185 WA Remaining Months to Maturity For the stratified attribute, the weighted average number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-186 Seller City The city of the address of the entity that sold the loan to the issuer. String 50 SS-187 Seller State The state or territory of the address of the entity that sold the loan to the issuer. String 2 Servicer Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-188 Record Type 17 Servicer Name Stratification String 2 SS-189 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-190 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-191 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-192 Servicer Name The name of the entity that services the loan during the current reporting period. Will reflect servicer names contributing 1 of the Current Investor Security UPB. String 100 SS-193 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17",
        "page_64": "64 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Servicer Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-194 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-195 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-196 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 SS-197 Minimum Loan Age For the stratified attribute, the minimum number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-198 Maximum Loan Age For the stratified attribute, the maximum number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-199 Minimum Interest Rate For the stratified attribute, the minimum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-200 Maximum Interest Rate For the stratified attribute, the maximum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-201 Minimum Remaining Months to Maturity For the stratified attribute, the minimum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-202 Maximum Remaining Months to Maturity For the stratified attribute, the maximum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-203 WA Loan Age For the stratified attribute, the weighted average number of scheduled payments from the time the loan was originated or modified to and including the current reporting period. Numeric 3 SS-204 WA Interest Rate For the stratified attribute, the weighted average interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-205 WA Remaining Months to Maturity For the stratified attribute, the weighted average number of scheduled monthly payments that will reduce the Current Numeric 3",
        "page_65": "65 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Servicer Name Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes Investor Loan UPB to zero. SS-206 Servicer City The city of the address of the entity that services the loan. String 50 SS-207 Servicer State The state or territory of the address of the entity that services the loan. String 2 Mortgage Insurance Coverage Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-208 Record Type 18 Mortgage Insurance Coverage Stratification String 2 SS-209 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-210 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-211 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-212 Mortgage Insurance Coverage The mortgage insurance coverage in effect at the time the security was issued. WithMI Loans with Mortgage Insurance NoMI Loans Without Mortgage Insurance 99 Not Available String 6 SS-213 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-214 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-215 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-216 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Mortgage Insurance Cancellation Indicator Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-217 Record Type 19 Mortgage Insurance Cancellation Indicator Stratification String 2",
        "page_66": "66 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-218 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-219 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-220 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-221 Mortgage Insurance Cancellation Indicator The indicator denoting whether the mortgage insurance has been cancelled after the security was issued. Yes No 7 Not Applicable String 1 SS-222 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-223 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-224 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-225 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Government Insured Guarantee Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-226 Record Type 20 Government Insured Guarantee Stratification String 2 Government Insured Guarantee loans SS-227 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-228 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-229 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-230 Government Insured Guarantee The classification describing the Government Insured Guarantee Program, if any, covering the loan. FH FHA VA Veterans Affair RH Rural Housing IH Section 184 Indian Home 99 Not Available String 2 SS-231 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-232 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6",
        "page_67": "67 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-233 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-234 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Interest Only First Principal and Interest Payment Date Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-235 Record Type 21 Interest Only First Principal and Interest Payment Date Stratification String 2 SS-236 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-237 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-238 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-239 Interest Only First Principal and Interest Payment Date For interest-only loans, the month and year that the first monthly scheduled fully amortizing principal and interest payment is due. Date MMCCYY 6 SS-240 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-241 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-242 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-243 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 SS-244 Minimum Loan Age For the stratified attribute, the minimum number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-245 Maximum Loan Age For the stratified attribute, the maximum number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-246 Minimum Interest Rate For the stratified attribute, the minimum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6",
        "page_68": "68 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Interest Only First Principal and Interest Payment Date Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-247 Maximum Interest Rate For the stratified attribute, the maximum interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-248 Minimum Remaining Months to Maturity For the stratified attribute, the minimum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-249 Maximum Remaining Months to Maturity For the stratified attribute, the maximum number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-250 WA Loan Age For the stratified attribute, the weighted average number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period. Numeric 3 SS-251 WA Interest Rate For the stratified attribute, the weighted average interest rate of the loan in effect during the current reporting period. Numeric 2.3 6 SS-252 WA Remaining Months to Maturity For the stratified attribute, the weighted average number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. Numeric 3 SS-253 WA Months to Amortization For the stratified attribute, the weighted average number of months from the current month to the first scheduled principal and interest payment date. Numeric 3 Not Paying Principal in First Distribution Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-254 Record Type 22 Not Paying Principal in First Distribution Stratification. Loans that will not receive principal distribution in the first investor payment. String 2 Applicable only at issuance for Single - Class no resecuritizations SS-255 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-256 Security Identifier The unique designation assigned to the security by the issuer. String 6",
        "page_69": "69 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-257 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-258 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-259 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-260 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-261 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Year Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-262 Record Type 23 Origination Year Stratification String 2 SS-263 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-264 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-265 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-266 Origination Year The year of origination of the loans in the security. Date CCYY 4 All loans originated prior to 1985 will be disclosed as 1984. SS-267 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-268 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-269 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-270 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Channel Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-271 Record Type 24 Origination Channel Stratification String 2 If security characteristics apply SS-272 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3",
        "page_70": "70 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-273 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-274 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-275 Origination Channel For reperforming, modified fixed-rate and modified step-rate loans, the origination channel used by the party that delivered the loan to the issuer. Retail Broker Correspondent Third Party Origination - Not Specified 9 Not Available String 1 SS-276 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-277 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-278 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-279 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Non-Standard Loan Type Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-280 Record Type 25 Non-Standard Loan Type Stratification String 2 Applicable only at issuance for Single - Class no resecuritizations . Totals may exceed 100 . Effective 10 17 2017, this stratification will no longer be populated. SS-281 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-282 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-283 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-284 Non-Standard Loan Type The non-standard loan characteristics included in the security. COOP Cooperative HIGH FHFA High Cost Area BYDN Interest-rate buydown RELO Relocation String 4 SS-285 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Numeric 14.2 17",
        "page_71": "71 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Loan UPB for the loans in the security. SS-286 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-287 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-288 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Modification Program Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-289 Record Type 26 Modification Program Stratification String 2 If security characteristics apply SS-290 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-291 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-292 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-293 Modification Program For reperforming, modified fixed-rate and modified step-rate loans, the program under which the loan was modified. Alternative HAMP Backup Classic Payment Deferral Extend Flex HAMP Other Cap and Extend Regular Standard Streamlined Underwater 9 Not Available String 1 Effective beginning 9 21 2020 SS-294 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 If security characteristics apply SS-295 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-296 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-297 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Modification Type Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes",
        "page_72": "72 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-298 Record Type 27 Modification Type Stratification String 2 SS-299 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-300 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-301 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-302 Modification Type For reperforming, modified fixed-rate and modified step-rate loans, the classification describing the type of modification. Rate Term Capitalization Deferred Amount Rate, Term Deferred Amount Other Rate Rate Deferred Amount Term Term Deferred Amount String 1 Effective beginning 9 21 2020 SS-303 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-304 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-305 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-306 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Modification Information Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-307 Record Type 28 Modification Information Stratification String 2 If security characteristics apply SS-308 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-309 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-310 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-311 Modification Information For reperforming, modified fixed-rate and modified step-rate loans, the Total Capitalized Amounts and Deferred Unpaid Principal Balances of the loans in the security. Total Capitalized Amount Deferred Unpaid Principal Balance Numeric 9.2 12",
        "page_73": "73 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-312 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-313 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-314 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-315 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Number of Modifications Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-316 Record Type 29 Number of Modifications Stratification String 2 SS-317 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-318 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-319 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-320 Number of Modifications For reperforming, modified fixed-rate and modified step-rate loans, the number of times the loan has been modified. 1 2 2 Numeric 2 SS-321 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-322 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-323 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-324 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Deferred Unpaid Principal Balance Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-325 Record Type 30 Deferred Unpaid Principal Balance Stratification String 2 If security characteristics apply SS-326 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-327 Security Identifier The unique designation assigned to the security by the issuer. String 6",
        "page_74": "74 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-328 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-329 Deferred UPB Type For reperforming, modified fixed-rate and modified step-rate loans, denotes if the reported unpaid principal balance includes any deferred amount. WithDefUPB With Deferred UPB NoDefUPB Without Deferred UPB 99 Not Available String 10 SS-330 Interest-Bearing UPB For reperforming, modified fixed-rate and modified step-rate loans, the aggregate interest bearing unpaid principal balance at the time of modification. Numeric 14.2 17 SS-331 Deferred UPB For reperforming, modified fixed-rate and modified step-rate loans, the aggregate non- interest bearing amount at the time of modification. This amount does not contribute to MBS. Numeric 14.2 17 SS-332 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-333 Weighted Average Interest Rate For the stratified attribute, the weighted average interest rate of the loans in effect during the current reporting period. Numeric 3.2 6 SS-334 Weighted Average Estimated LTV ELTV For the stratified attribute in reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio obtained by dividing the outstanding balance of the mortgage loan by the estimated current value of the property obtained by the issuer, at the time of issuance. Numeric 3 SS-335 Weighted Average Updated Credit Score For the stratified attribute in reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average most recently available standardized credit score provided at the time of issuance. Numeric 4",
        "page_75": "75 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-336 Weighted Average Debt to Income DTI Ratio For the stratified attribute in reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio obtained by dividing the total monthly debt expense by the total monthly income of the borrower at the time the loan was originated or modified. Numeric 3 SS-337 Average Mortgage Loan Amount For the stratified attribute in reinstated, reperforming, modified fixed-rate and modified step-rate loans, the simple average dollar amount of the loan as stated on the note at the time the loan was originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 SS-338 Property State 1 The abbreviation denoting the location of the property securing the loan for the stratified attribute. Ranked 1 by Investor Loan UPB See Appendix String 2 SS-339 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security that are associated with Property State 1 ranked by Investor Loan UPB . Numeric 14.2 17 SS-340 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security that are associated with Property State 1 ranked by Investor Loan UPB . Numeric 3.2 6 SS-341 Aggregate Loan Count For the stratified attribute, the total number of loans in the security that are associated with Property State 1 ranked by Investor Loan UPB . Numeric 9 SS-342 Percentage Loan Count For the stratified attribute, the percentage of loans in the security with Property State 1 ranked by Investor Loan UPB . Numeric 3.2 6 SS-343 Property State 2 The abbreviation denoting the location of the property securing the loan for the stratified attribute. Ranked 2 by Investor Loan UPB See Appendix String 2",
        "page_76": "76 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-344 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security that are associated with Property State 2 ranked by Investor Loan UPB . Numeric 14.2 17 SS-345 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security that are associated with Property State 2 ranked by Investor Loan UPB . Numeric 3.2 6 SS-346 Aggregate Loan Count For the stratified attribute, the total number of loans in the security that are associated with Property State 2 ranked by Investor Loan UPB . Numeric 9 SS-347 Percentage Loan Count For the stratified attribute, the percentage of loans in the security with Property State 2 ranked by Investor Loan UPB . Numeric 3.2 6 SS-348 Property State 3 The abbreviation denoting the location of the property securing the loan for the stratified attribute. Ranked 3 by Investor Loan UPB See Appendix String 2 SS-349 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security that are associated with Property State 3 ranked by Investor Loan UPB . Numeric 14.2 17 SS-350 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security that are associated with Property State 3 ranked by Investor Loan UPB . Numeric 3.2 6 SS-351 Aggregate Loan Count For the stratified attribute, the total number of loans in the security that are associated with Property State 3 ranked by Investor Loan UPB . Numeric 9 SS-352 Percentage Loan Count For the stratified attribute, the percentage of loans in the security with Property State 3 ranked by Investor Loan UPB . Numeric 3.2 6 Estimated Loan-to-Value ELTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-353 Record Type 31 Estimated Loan-to-Value ELTV Not Available Stratification String 2 If security characteristics apply SS-354 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3",
        "page_77": "77 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-355 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-356 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-357 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. String 14.2 17 SS-358 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-359 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 3.2 6 SS-360 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 9 Updated Credit Score Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-361 Record Type 32 Updated Credit Score Not Available Stratification For non-reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. String 2 If security characteristics apply SS-362 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-363 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-364 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-365 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-366 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-367 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-368 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6",
        "page_78": "78 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Number of Remaining Steps Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-369 Record Type 33 Number of Remaining Steps Stratification String 2 If security characteristics apply SS-370 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-371 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-372 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-373 Number of Remaining Steps For reperforming, modified step-rate loans, the number of upward interest rate adjustments remaining. Numeric 2 SS-374 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-375 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-376 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-377 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Number of Steps - At Modification Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-378 Record Type 34 Number of Steps - At Modification Stratification String 2 Freddie Mac Modified Step securities SS-379 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-380 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-381 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-382 Number of Steps - At Modification For reperforming, modified step-rate loans, the number of upward interest rate adjustments at the time of modification. Numeric 2",
        "page_79": "79 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-383 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-384 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-385 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-386 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Next Step Rate Adjustment Date Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-387 Record Type 35 Next Step Rate Adjustment Date Stratification String 2 Freddie Mac Modified Step securities SS-388 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-389 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-390 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-391 Next Step Rate Adjustment Date For reperforming, modified step-rate loans, the month and year that the interest rate is scheduled to increase. Date MMCCYY 6 SS-392 Projected WA Interest Rate For reperforming, modified fixed-rate and modified step-rate loans, the projected weighted average of the expected interest rates in effect on the associated adjustment date, not accounting for prepayments. Numeric 2.3 6 SS-393 Projected WA Net Interest Rate For reperforming, modified fixed-rate and modified step-rate loans, the projected weighted average of the expected interest rates in effect on the associated adjustment date, not accounting for prepayments less servicing fees and guarantor fees. Numeric 2.3 6 SS-394 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-395 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Numeric 3.2 6",
        "page_80": "80 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Next Step Rate Adjustment Date Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes Investor Loan UPB for the loans in the security. SS-396 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-397 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Loan-To-Value LTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-398 Record Type 36 Origination Loan-To- Value LTV Not Available Stratification For non- reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. String 2 If security characteristics apply SS-399 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-400 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-401 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-402 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-403 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-404 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-405 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Combined Loan-To-Value CLTV Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-406 Record Type 37 Origination Combined Loan-To-Value CLTV Not Available Stratification For non- reperforming, modified fixed-rate and String 2 If security characteristics apply",
        "page_81": "81 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files modified step-rate loans, this value will be blank. SS-407 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-408 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-409 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-410 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-411 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-412 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-413 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Debt-To-Income DTI Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-414 Record Type 38 Origination Debt-To- Income DTI Not Available Stratification For non- reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. String 2 If security characteristics apply SS-415 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-416 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-417 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-418 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-419 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Numeric 3.2 6",
        "page_82": "82 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Investor Loan UPB for the loans in the security. SS-420 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-421 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Borrower Credit Score Not Available Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-422 Record Type 39 Origination Borrower Credit Score Not Available Stratification String 2 If security characteristics apply SS-423 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-424 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-425 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-426 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-427 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-428 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-429 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Loan Purpose Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-430 Record Type 40 Origination Loan Purpose Stratification String 2 If security characteristics apply SS-431 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-432 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-433 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9",
        "page_83": "83 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-434 Origination Loan Purpose Stratification For reperforming, modified fixed-rate and modified step-rate loans, the classification of the loan as either purchase money mortgage or refinance mortgage at the time the loan was originated. Refinance - Cash Out Refinance - No Cash Out Refinance - Not Specified Purchase Modified - Loss Mitigation 9 Not Available String 1 SS-435 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-436 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-437 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-438 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Origination Occupancy Status Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-439 Record Type 41 Origination Occupancy Status Stratification String 2 If security characteristics apply SS-440 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-441 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-442 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-443 Origination Occupancy Status For reperforming, modified fixed-rate and modified step rate loans, the classification describing the property occupancy status at the time the loan was originated. Primary Residence Second Home Investment Property 9 Not Available String 1 SS-444 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-445 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-446 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-447 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Borrower Payment History Stratification",
        "page_84": "84 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-448 Record Type 42 Borrower Payment History Stratification String 2 Applicable at issuance for Modified Fixed and Step and Reinstated MBS Applicable to Level 1 securities only SS-449 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-450 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-451 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-452 Days Delinquent For reperforming, modified and modified step-rate loans, the number of days for which mortgage loan was reported delinquent. 0 Current 1 30-59 2 60-89 3 90-119 4 120 String 1 SS-453 Borrower Payment Date The month and year that the borrower was scheduled to remit payment. Date MMCCYY 6 SS-454 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-455 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-456 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-457 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Collateral List ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-458 Record Type 43 Collateral List String 2 Applicable at Issuance for Single Class Resecuritizations SS-459 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-460 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-461 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9",
        "page_85": "85 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Collateral List ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-462 Collateral Prefix For each security that directly underlies the resecuritization, the designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-463 Collateral Security Identifier For each security that directly underlies the resecuritization, the unique designation assigned to the security by the issuer. String 6 SS-464 Collateral CUSIP For each security that directly underlies the resecuritization, the unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-465 Collateral Current WA Net Interest Rate For each security that directly underlies the resecuritization, the weighted average interest rate of the loans in effect during the current reporting period less servicing fees and guarantor fees. Numeric 2.3 6 SS-466 Collateral Issue Date For each security that directly underlies the resecuritization, the date on which the security was issued. Date MMDDCCYY 8 SS-467 Collateral Issuer The issuer for each security that directly underlies the resecuritization. String 3 SS-468 Collateral Maturity Date The month and year in which the final payment on the underlying security is scheduled to be made at the time the underlying security was issued. Date MMCCYY 6 SS-469 Collateral Issuance Investor Security UPB For each security that directly underlies the resecuritization, the unpaid principal balance of the loans as they contribute to the balance of the security. Numeric 12.2 15 SS-470 Collateral Issuance Contributing Investor Security UPB For each security that directly underlies the resecuritization, the pro- rata share of the Investor Security UPB - Issuance amount Numeric 12.2 15",
        "page_86": "86 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Collateral List ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-471 Collateral Current Contributing Investor Security UPB For each security that directly underlies the resecuritization, the pro- rata share of the Investor Security UPB - Current amount. Numeric 12.2 15 SS-472 Collateral WA Interest Rate at Settlement For each security that directly underlies the resecuritization, the weighted average interest rate at the time of resecuritization. Numeric 2.3 6 SS-473 Collateral WA Remaining Months to Maturity at Settlement For each security that directly underlies the resecuritization, the weighted average number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero at the time of resecuritization. Numeric 3 SS-474 Collateral WA Loan Age at Settlement For each security that directly underlies the resecuritization, the weighted average number of scheduled payments from the time the loan was originated or modified up to and including the current reporting period at the time of resecuritization. Numeric 3 SS-475 Collateral Trust Identifier An identifier assigned to the trust when established into multiclass resecuritization. String 50 SS-476 Collateral Class Identifier An identifier assigned to the class when established into multiclass resecuritization. String 4 SS-477 Group Identifier An identifier assigned to the group when established into multiclass resecuritization. String 5 Property Valuation Method Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-478 Record Type 44 Property Valuation Method Stratification String 2 Disclosure will be effective for loans backing pools issued as June 1, 2017. This disclosure will first appear with March 2020 issuances. SS-479 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-480 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-481 CUSIP The unique designation assigned to the security String 9",
        "page_87": "87 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files by the Committee on Uniform Securities Identification Procedures CUSIP . SS-482 Property Valuation Method Indicates the method by which the value of the subject property was obtained. Appraisal Appraisal Waiver Appraisal Waiver plus Onsite Property Data Collection - Value Appraisal Waiver plus Onsite Property Data Collection Condition GSE Targeted Refinance Programs Other 7 Not Applicable 9 Not Available String 1 Please reference the loan-level file specification for enumeration definitions L-107 . Appraisal Waiver plus Property Data Collection Condition is effective beginning June 20, 2023. Prior to Sept 2023, represents Onsite Property Data Collection . Effective Sept 2023, represents Appraisal Waiver plus Property Data Collection Value . SS-483 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-484 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-485 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-486 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Borrower Assistance Plan Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-487 Record Type 45 Borrower Assistance Plan Stratification String 2 SS-488 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-489 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-490 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-491 Borrower Assistance Plan The type of assistance plan that the borrower is enrolled in that provides temporary mortgage payment relief or an opportunity to cure mortgage delinquency over defined period. Loans that are in review for modification, repayment plan or Forbearance Plan Repayment Plan Trial Period Plan Other Workout Plan No Workout Plan 7 Not Applicable 9 Not Available String 1 The data in this stratification will be published on one-month delay due to the timing of our servicing reporting cycle. For example, the values in this stratification published in July 2020 correspond to the delinquency status in the Days Delinquent",
        "page_88": "88 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files payment deferral offer will be included as part of the Forbearance disclosure until the borrower accepts, declines or is determined to be ineligible for workout plan. Stratification published in June 2020. For non-delinquent loans without borrower assistance plan reported will be disclosed as 7-Not Applicable while delinquent loans without borrower assistance plan reported will be disclosed as N-No Workout Plan . SS-492 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-493 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-494 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-495 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Alternative Delinquency Resolution Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-496 Record Type 46 Alternative Delinquency Resolution Stratification String 2 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. SS-497 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-498 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-499 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-500 Alternative Delinquency Resolution Loss mitigation solution that resolves delinquencies and help homeowners remain in their homes in accordance with the servicer contractual obligation, while allowing the loan to remain in the security. Payment Deferral COVID-19 Payment Deferral Disaster Payment Deferral Multiple Other 7 Not Applicable 9 Not Available String 1 Please reference the loan- level file specification for enumeration definitions L- 108 . Loans that have completed multiple ADR plans will be disclosed as Multiple at the pool level. SS-501 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-502 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-503 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-504 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6",
        "page_89": "89 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-505 Total Deferral Amount The total non-interest- bearing deferral amount related to one or more Alternative Delinquency Resolutions. Numeric 9.2 12 Number of Alternative Delinquency Resolutions Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-506 Record Type 47 Number of Alternative Delinquency Resolutions Stratification String 2 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. SS-507 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-508 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-509 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-510 Number of Alternative Delinquency Resolutions The total number of Alternative Delinquency Resolutions as reported by the servicer for specific loan. 01 02 03 04 05 5 String 2 May not represent 100 of the pool SS-511 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-512 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-513 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-514 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 SS-515 Total Deferral Amount The total non-interest- bearing deferral amount related to one or more Alternative Delinquency Resolutions. For modified loans, this may include additional non-interest- bearing deferral amounts related to prior modification. Numeric 9.2 12 Borrower Assistance Plan History Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-516 Record Type 48 Borrower Assistance Plan History Stratification String 2 Applicable for issuance disclosure only Effective as of 2 22 2021 Applicable to Level 1 securities only SS-517 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3",
        "page_90": "90 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files SS-518 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-519 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-520 Borrower Assistance Plan History For reperforming or modified loan in newly issued security, the type of borrower assistance plan that the borrower was enrolled in at any time during the 36 months prior to issuance of such security. Loans that are in review for modification, repayment plan or payment deferral offer will be included as part of the Forbearance disclosure until the borrower accepts, declines or is determined to be ineligible for workout plan. Forbearance Plan Repayment Plan Trial Period Plan Other Workout Plan No Workout Plan 7 Not Applicable 9 Not Available String 1 SS-521 Borrower Payment Date The month and year that the borrower was scheduled to remit payment. Date MMCCYY 6 SS-522 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-523 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-524 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-525 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Special Eligibility Program Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-526 Record Type 49 Special Eligibility Program Stratification String 2 Populated for issuance disclosure beginning 8 16 2021 if applicable and for monthly disclosure beginning 9 7 2021. SS-527 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-528 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-529 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-530 Special Eligibility Program mortgage program with expanded eligibility criteria Home Possible HomeReady String 1",
        "page_91": "91 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files designed to increase and maintain home ownership. HFA Advantage HFA Preferred Refi Possible RefiNow Other 7 Not Applicable 9 Not Available SS-531 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-532 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-533 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-534 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Interest Rate Buydown Type Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-535 Record Type 50 Interest Rate Buydown Type String 2 Disclosure is effective beginning with pools issued as of January 1, 2022. SS-536 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-537 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-538 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-539 Interest Rate Buydown Type An arrangement whereby party deposits funds to an account which is used to temporarily reduce borrower monthly payment through temporary reduction in the interest rate. Temporary An Interest Rate Buydown in which the interest rate is bought down by less than or equal to 2 and for less than or equal to 24 months. Fannie Mae product is known as Moderate. Extended An Interest Rate Buydown in which the interest rate is bought down by greater than 2 or for greater than 24 months. Fannie Mae product is known as Significant. Other Any Interest Rate Buydown type not provided within the other enumerations. Not Applicable Interest Rate Buydown type is not MT Moderate Temporary SE Significant Extended Other 7 Not Applicable 9 Not Available String 2 Per Freddie Mac Selling Guide, the maximum interest rate reduction cannot exceed 3 , buydown period cannot exceed 3 years, and the interest rate increase cannot exceed 1 per year. Additionally, the Temporary Buydown described in this disclosure is the same as Limited Buydown in the Freddie Mac Seller Servicer Guide.",
        "page_92": "92 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files applicable to the related mortgage loan. Not Available Interest Rate Buydown type is not available for disclosure. SS-540 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-541 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-542 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-543 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Green Program Criteria Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-544 Record Type 51 Green Program Criteria String 2 This stratification is only provided for pools where Green Indicator Y. This disclosure will first appear with March 2024 disclosure files. SS-545 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-546 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-547 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-548 Green Program Criteria The share of loans secured by properties with eligible energy efficiency program , including Green Building Certifications, Energy Rating Indices, and Renewable Energy sources Green Building Certification Energy Rating Index Renewable Energy Multiple Other String 1 Loans shall be categorized as Multiple if it qualifies as Green in at least 2 Green Programs Criteria i.e., Energy Rating Index and Renewable Energy . SS-549 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-550 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-551 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-552 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6",
        "page_93": "93 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files Green Building Certification Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-553 Record Type 52 Green Building Certification String 2 This stratification is only provided for pools where Green Indicator Y. This disclosure will first appear with March 2024 disclosure files. SS-554 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-555 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-556 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-557 Green Building Certification The share of loans secured by properties certified to eligible green building certifications. EnergyStar DOE Zero Energy Ready Home National Green Building Standard NEEM Other String 1 SS-558 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-559 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-560 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-561 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Energy Rating Index Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-562 Record Type 53 Energy Rating Index String 2 This stratification is only provided for pools where Green Indicator Y. This disclosure will first appear with March 2024 disclosure files. SS-563 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-564 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-565 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-566 Energy Rating Index The share of loans secured by properties scored using Home Energy Rating Score Other String 1",
        "page_94": "94 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files eligible energy rating indices. SS-567 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-568 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-569 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-570 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6 Renewable Energy Stratification ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes SS-571 Record Type 54 Renewable Energy String 2 This stratification is only provided for pools where Green Indicator Y. This disclosure will first appear with March 2024 disclosure files. SS-572 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 SS-573 Security Identifier The unique designation assigned to the security by the issuer. String 6 SS-574 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 SS-575 Renewable Energy The share of loans secured by properties with renewable energy sources. Solar Geothermal Other String 1 SS-576 Aggregate Investor Loan UPB For the stratified attribute, the sum of the Investor Loan UPB for the loans in the security. Numeric 14.2 17 SS-577 Percentage Investor Loan UPB For the stratified attribute, the percentage of the Investor Loan UPB for the loans in the security. Numeric 3.2 6 SS-578 Aggregate Loan Count For the stratified attribute, the total number of loans in the security. Numeric 9 SS-579 Percentage Loan Count For the stratified attribute, the percentage of loans in the security. Numeric 3.2 6",
        "page_95": "95 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Exchange Files EXCHANGE FILES",
        "page_96": "96 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Exchange Files Daily 45-Day to 55-Day Exchange Activity This disclosure contains one row for every exchange transaction where Freddie Mac 45-day payment delay security exchanged directly to its corresponding 55-day mirror security on given As of Date. The report includes the details about the corresponding pairs of 45 and 55-day securities and the amount of Issuance Investor Security UPB Original Par exchanged and settled as part of each transaction on the As of Date. ID Attribute Name Attribute Definition Data Type Format Max Length Implementation Notes 01 Freddie Mac 45 Day Security Identifier The unique designation assigned to the 45-day security Alpha-Numeric 6 02 Freddie Mac 45 Day Security CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . Alpha-Numeric 9 03 Freddie Mac 55 Day Security Identifier The unique designation assigned to the 55-day security. This security is identical to the 45-day PCs except for payment delay, Security Identifier, CUSIP and, in most cases, issuance date. The 45-day PC is the collateral for the 55-day MBS. Alpha-Numeric 6 04 Freddie Mac 55 Day Security CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . The 55-day MBS CUSIP was created as mirror of the 45-day PC. Alpha-Numeric 9 05 Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Numeric 14.2 17 Truncated to whole number 06 Exchanged Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Reflects the amount of the security that was exchanged directly to its corresponding 55-day security. Numeric 14.2 17 Truncated to whole number 07 Cumulative Exchanged Issuance Investor Security UPB The total of the Issuance Investor Security UPB Original Par of the 45-day PC that has been exchanged directly to its corresponding 55-day MBS to date, including all current daily exchange activity. Numeric 14.2 17 Truncated to whole number 08 As of Date The Settlement Date through which the exchange activity is included in this disclosure. Date MMDDCCYY 8",
        "page_97": "97 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Exchange Files Cumulative 45-Day to 55-Day Exchange Activity This disclosure contains one row for every Freddie Mac 45-day payment delay security eligible to be exchanged, i.e. those that are not 100 committed to resecuritizations and for which corresponding 55-day mirror security has been issued. The report includes one row per exchange eligible security, regardless of whether any exchange activity has occurred to date, with details about the corresponding pairs of 45 and 55-day securities and the amount of Issuance Investor Security UPB Original Par exchanged and settled to date. ID Attribute Name Attribute Definition Data Type Format Max Length Implementation Notes 01 Freddie Mac 45 Day Security Identifier The unique designation assigned to the 45-day security Alpha-Numeric 6 02 Freddie Mac 45 Day Security CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . Alpha-Numeric 9 03 Freddie Mac 55 Day Security Identifier The unique designation assigned to the 55-day security. This security is identical to the 45-day PCs except for payment delay, Security Identifier, CUSIP and, in most cases, issuance date. The 45-day PC is the collateral for the 55-day MBS. Alpha-Numeric 6 04 Freddie Mac 55 Day Security CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . The 55-day MBS CUSIP was created as mirror of the 45-day PC. Alpha-Numeric 9 05 Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Numeric 14.2 17 Truncated to whole number 06 Cumulative Exchanged Issuance Investor Security UPB The total of the Issuance Investor Security UPB Original Par of the 45-day PC that has been exchanged directly to its corresponding 55-day MBS to date, including all current daily exchange activity. Numeric 14.2 17 Truncated to whole number 07 As of Date The Settlement Date through which the exchange activity is included in this disclosure. Date MMDDCCYY 8",
        "page_98": "98 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Exchange Files Aggregate Level 1 Collateral Exchange Activity This disclosure contains one row for every Freddie Mac 45-day payment delay Level 1 PC, even if the PC is not eligible to be exchanged. Because exchanges can be done on Level 1 or at Level 2 securities, this report breaks out all exchanges on the basis of the lowest Level 1 PC collateral, i.e. allocating all exchanges of Giants back to their original Level 1 PC collateral and adding that to any exchanges from Level 1 PC directly to its corresponding mirror. This report can be used to determine the 45- day and 55-day supply and prepayments across any Legacy cohort. ID Attribute Name Attribute Definition Data Type Format Max Length Implementation Notes 01 Level 1 Security Identifier The unique designation assigned to the 45-day Level 1 security. Alpha-Numeric 6 02 Level 1 Security CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . Alpha-Numeric 9 03 Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Numeric 14.2 17 Truncated to whole number 04 Resecuritized Issuance Investor Security UPB The total original issuance UPB Original Par of this PC that is committed to REMICs and or Giants. Numeric 14.2 17 Truncated to whole number 05 Cumulative Exchanged Issuance Investor Security UPB The total of the Issuance Investor Security UPB Original Par of the 45-day PC that has been exchanged directly to its corresponding 55-day MBS to date, including all current daily exchange activity. Numeric 14.2 17 Truncated to whole number 06 Issuance Investor Security UPB Remaining Eligible for Exchange The amount of Issuance Investor Security UPB Original Par that has not yet been exchanged or resecuritized, and therefore remains eligible for exchange. Numeric 14.2 17 Investor Security UPB at Issuance - Resecuritized Investors Security UPB at Issuance - Cumulative Exchanged Investor Security UPB at Issuance 07 Cumulative Issuance Investor Security UPB Exchanged through Resecuritizations The amount of Issuance Investor Security UPB Original Par that is committed to Giant, which has been exchanged to date as result of the Giant exchange activity REMICs are not exchange eligible . This includes the current daily exchange settlement activity, if any. Numeric 14.2 17 Truncated to whole number 08 Aggregate Exchanged Issuance Investor Security UPB The total of the Issuance Investor Security UPB Original Par of the 45-day PC that has been exchanged directly to its corresponding 55-day MBS to date, including all current daily exchange activity. Numeric 14.2 17 Cumulative Exchanged Investor Security UPB at Issuance Cumulative Investor UPB at Issuance Exchanged through Resecuritizations",
        "page_99": "99 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Exchange Files ID Attribute Name Attribute Definition Data Type Format Max Length Implementation Notes 09 Aggregate Issuance Investor Security UPB Remaining Eligible for Exchange The total Issuance Investor Security UPB Original Par that has not yet been exchanged either directly to its corresponding 55-day MBS or through the exchange of Giant that has this PC as underlying collateral, and therefore remains eligible for exchange. Numeric 14.2 17 Investor Security UPB at Issuance - Aggregate Exchanged Investor Security UPB at Issuance 10 Security Factor The decimal value that, when multiplied by the Issuance Investor Security UPB amount, equals the Current Investor Security UPB amount. Numeric 1.8 10 Rounded to the 8th decimal position. 11 Security Factor Date The month and year on which the corresponding factor is effective. Date MMCCYY 6 12 As of Date The Settlement Date through which the exchange activity is included in this disclosure. Date MMDDCCYY 8",
        "page_100": "Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 100 Multiclass Single Class Tax Disclosure Files MULTICLASS SINGLE CLASS TAX DISCLOSURE FILES",
        "page_101": "101 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Multiclass Single Class Tax Disclosure Files For Multiclass Tax Files These files contain selected tax reporting data about Freddie Mac Multiclass securities programs. This data should be considered in conjunction with information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The files provide disclosure of tax reporting amounts that are to be used to complete the necessary tax filings for holders of Freddie Mac issued Multiclass securities. The Tax Disclosure files will be available on quarterly basis, on the 30th calendar day of the month following the end of the quarter e.g. Q1 data is transmitted on the last business day in April . The factor files are cumulative on year-to-date basis. For Single Class Tax Files These files contain selected tax reporting data about Freddie Mac Single Class securities programs. This data should be considered in conjunction with information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The files provide disclosure of tax reporting amounts that are to be used to complete the necessary tax filings for holders of Freddie Mac issued Multiclass securities. The Tax Disclosure files will be available on quarterly basis, on the 30th calendar day of the month following the end of the quarter e.g. Q1 data is transmitted on the last business day in April . The factor files are cumulative on year-to-date basis. Type File Record Field Data Type Length End Position Format Example CUSIP character 9 9 3136055Y9 filler space 1 10 Pool or series number character 8 18 002098, 2012-102 filler space 1 19 Class character 8 27 MC Tranche Name MC only, Blank for SC ex. ZA, AB, A1 filler space 1 28 Security Classification character 5 33 WHMT, REMIC filler space 1 34 Class Issued With character 13 47 OID, PAR, DEMINIMUS, PREMIUM filler space 1 48 Interest Class character 13 61 NON-QUALIFIED, QUALIFIED filler space 1 62 Interest accrual method character 7 69 30 360 filler space 1 70 Original amount integer 12 82 4784368",
        "page_102": "102 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Multiclass Single Class Tax Disclosure Files filler space 1 83 Issuer TIN character 10 93 xx-xxxxxxx filler space 1 94 Issuer name1 character 50 144 Issue Name Federal National Mortgage Association, FHLMC Trust filler space 1 145 Issuer name2 character 50 195 Attention line Blank filler space 1 196 Issuer address1 character 50 246 Street Address 1100 15TH STREET NW WASHINGTON DC 20005 1551 PARK RUN DRIVE MCLEAN VA 22102-3110 Factor File Record Field Data Type Length End Position Format Example CUSIP character 9 9 3136055Y9 filler space 1 10 Days In Period integer 3 13 30 filler space 1 14 Beginning Of Accrual Period date 10 24 YYYYMMDD 20180831 filler space 1 25 End Of Accrual Period date 10 35 YYYYMMDD 20180831 filler space 1 36 Payment Date date 10 46 YYYYMMDD 20180831 filler space 1 47 Ending UPB Factor Number 13,8 14 61 12345.12345678 filler space 1 62 QSI Factor Number 13,8 14 76 12345.12345678 filler space 1 77 OID Factor Number 13,8 14 91 12345.12345678 filler space 1 92 Other Inc Exp Factor Number 13,8 14 106 12345.12345678 filler space 1 107 Section 212 Expense Factor Number 13,8 14 121 12345.12345678 filler space 1 122 AIP at Beginning of Period Factor Number 13,8 14 136 12345.12345678 If Interest Class is Qualified or calculated value exceeds field length, then blank, else show value. filler space 1 137 Market Discount Accrual Ratio Number 13,8 14 151 12345.12345678 filler space 1 152 Real Estate Percentage Number 6,2 7 159 1234.12 Fields are padded with spaces to complete the fixed length file. Factors are expressed as monthly amounts accrued per 1000 The decimal data type is expressed as field maximum number of digits, places to the right of the decimal ",
        "page_103": "103 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Appendix APPENDIX A",
        "page_104": "104 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Appendix Property State Code Enumerations Enumeration Enumeration Name AK Alaska AL Alabama AR Arkansas AZ Arizona CA California CO Colorado CT Connecticut DC District of Columbia DE Delaware FL Florida GA Georgia GU Guam HI Hawaii IA Iowa ID Idaho IL Illinois IN Indiana KS Kansas KY Kentucky LA Louisiana MA Massachusetts MD Maryland ME Maine MI Michigan MN Minnesota MO Missouri MS Mississippi MT Montana NC North Carolina ND North Dakota NE Nebraska NH New Hampshire NJ New Jersey NM New Mexico NV Nevada NY New York OH Ohio OK Oklahoma OR Oregon PA Pennsylvania PR Puerto Rico RI Rhode Island SC South Carolina SD South Dakota TN Tennessee TX Texas UT Utah VA Virginia VI Virgin Islands VT Vermont WA Washington WI Wisconsin WV West Virginia WY Wyoming",
        "page_105": "105 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Appendix Single Family ARM Index Codes Enumeration Enumeration Name 02 FTSE USD IBOR Consumer Cash Fallback 6-Month 05 CMT 10YR WKLY AVG 08 CMT 1YR CUML AVG PREV12 MNTH AVG 09 CMT 1YR MNTH AVG 10 CMT 1YR WKLY AVG 11 CMT 2YR WKLY AVG 12 CMT 3YR MNTH AVG 13 CMT 3YR WKLY AVG 14 CMT 5YR WKLY AVG 16 CMT 5YR MNTH AVG 18 CMT 7YR MNTH 21 Enterprise 11th District COFI Replacement Index 22 COFI 1MO 7THDIST 23 COFI 1MO NTL MNTH AVG 25 COFI 6MO CA 27 COFI FRE 36 FTSE USD IBOR Consumer Cash Fallback 1-Month 38 FTSE USD IBOR Consumer Cash Fallback 12-Month 42 FTSE USD IBOR Consumer Cash Fallback 6-Month 43 FTSE USD IBOR Consumer Cash Fallback 6-Month 44 FTSE USD IBOR Consumer Cash Fallback 6-Month 46 PRIM MORT MRKT SRVY PLUS 48 PRIME WSJ DLY 49 RNY FRE 30YR 60DAY DLY 54 TBILL 6MO DISC MNTH AVG 55 TBILL 6MO DISC WKLY 57 TBILL 6MO INV WKLY 58 TBILL 6MO SEC WKLY AVG 59 ICE 5YR INT RATE SWAP 60 COFI 1MO 4THDIST 61 30-Day Average SOFR 555 MIXED INDICES Effective March 2022, enumeration 21 transitioned from COFI 1MO 11THDIST to Enterprise 11th District COFI Replacement Index . For more detailed information, please refer to the COFI Replacement Index announcement and COFI Replacement Index transition matrix. Effective July 2023, these enumerations transitioned from LIBOR based index to SOFR based replacement index. For more detailed information, please refer to the SOFR Replacement Index announcement, announcement on Refinitiv Index Name Change and the Reference Rate transition page. Furthermore, see FTSE disclaimer below. FTSE Disclaimer FTSE USD IBOR Cash Fallbacks are provided by LSEG and its affiliates. LSEG and its affiliates shall not be liable for any errors or delays in providing or making available the data contained within this service or for any actions taken in reliance on the same. FTSE USD IBOR Cash Fallbacks cannot be used for any commercial purpose including redistribution without license. Please contact LSEG A formerly Refinitiv if license is required. FTSE USD IBOR Cash Fallbacks are subject to LSEG terms of use and disclaimer available at https www.lseg.com en ftse- russell benchmarks usd-ibor-cash-fallbacks.",
        "page_106": "106 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Appendix Enumeration Name Abbreviations Abbreviation Meaning AA Actual Actual AVG Average BBA British Bankers Association CONT Contract CONV Conventional COS Cost of Savings CMT Constant Maturity Treasury CUML Cumulative DISC Discount DIST District DLY Daily FED Federal FRE Freddie Mac FRM Fixed Rate Mortgage INV Investment MM Money Market MNTH Monthly MO Month NTL National PREV26 Previous 26 PREV4 Previous 4 QRTY Quarterly RNY Required Net Yield SA Scheduled Actual SEC Secondary WKLY Weekly WSJ Wall Street Journal YLD Yield YR Year ICE Intercontinental Exchange SOFR Secured Overnight Financing Rate"
    }
}